[
{"Title": "Poland - Wikipedia", "Heading1": "Poland", "Heading2": "Contents", "URLText": "– in   (green & dark grey) – in the   (green)  –  [ ]  ( :      ), officially the   (Polish:      ), is a country located in  .  It is divided into 16  , covering an area of 312,696 square kilometres (120,733 sq mi), and has a largely   climate.  With a population of nearly 38.5 million people, Poland is the sixth most populous  .  Poland's capital and largest   is  . Other major cities include  ,  ,  ,  ,  , and  .\n Poland is bordered by the  ,  , and Russia's   to the north,   and   to the east,   and the   to the south, and   to the west.\n The history of   spans almost 500,000 years. Throughout the   the area became extensively diverse, with various cultures and tribes settling on the vast  . However, it was the   who dominated the region and gave  . The establishment of the first Polish state can be traced to AD 966, when  ,  ruler of the realm coextensive with the territory of present-day Poland, converted to  . The   was founded in 1025, and in 1569 it cemented   with the   by signing the  . This union formed the  , one of the largest (over 1,000,000 square kilometres - 400,000 square miles) and most populous countries of 16th and 17th century Europe, with a   political system  which adopted Europe's first written national constitution, the  .\n With the passing of  , the country was   at the end of the 18th century, and   in 1918 with the  . After a series of  , the new multi-ethnic Poland restored its position as a key player in European politics. In September 1939,   started with the   by  , followed by the   invading Poland in accordance with the  . Around six million  Polish citizens,  , perished in the war.  In 1947, the   was established as a   under  .  In the aftermath of the  , most notably through the emergence of the  , Poland reestablished itself as a presidential   republic.\n Poland has a   and is a regional power in Central Europe, with the largest   in the East-Central European zone.  It has the seventh largest economy by   in the   and the   in all of  . It's one of the most dynamic economies in the world,  simultaneously achieving a very high rank on the  .  Poland is a   country,  which maintains a   along with very high standards of  ,  ,  safety, education, and  .  Alongside a developed school  , the state also provides free  ,  , and a   system.  The country has 16    , 15 of which are cultural. \n Poland is a member state of the  , the  , the  ,  , the  , the  , the  , and guested at the  .\n The origin of the name \"Poland\" derives from the   tribe of   ( ), who inhabited the   river basin of present-day   region starting in the mid-6th century. The origin of the name   itself derives from the   word   (field). In some languages, such as Hungarian, Lithuanian, Persian and Turkish, the country's   is derived from the   (  or  ),  a   tribe, which dwelled on the south-eastern most edge of present-day  , in the   between the 7th and 11th centuries — lands which were part of the territorial domain ruled over by the Polans. Their name derives from the Proto-Slavic and   word   (open land or plain). \n The early   in Poland begun around 2400 BC, while the   commenced in approximately 700 BC.  During this time, the  , spanning both the Bronze and Iron Ages, became particularly prominent. The most famous archaeological find from   is the   fortified settlement (now reconstructed as an open-air museum), dating from the Lusatian culture of the late Bronze Age, around 748 BC. \n Throughout the   period, many distinct ancient ethnic groups populated the regions of what is now Poland in an era that dates from about 400 BC to 500 AD. These groups are identified as  ,  ,  ,  ,   and   tribes. Also, recent archeological findings in the   region, confirmed the presence of the   on the territory of Poland.  These were most likely expeditionary missions sent out to protect the   trade. The exact time and routes of the original migration and settlement of   lacks written records and can only be defined as fragmented.  The   tribes who would form Poland migrated to these areas in the second half of the 5th century AD. Up until the creation of   state and his subsequent conversion to Christianity in 966 AD, the main religion of West Slavic tribes that inhabited the geographical area of present-day Poland was  . With the   the Polish rulers accepted Christianity and the religious authority of the  . However, the transition from paganism was not a smooth and instantaneous process for the rest of the population as evident from the  . \n Poland began to form into a recognizable unitary and   around the middle of the 10th century under the  . Poland's first   ruler,  , accepted   under the auspices of the   with the   in 966, as the new   of his subjects. The bulk of   in the course of the next few centuries. In 1000,  , continuing the policy of his father Mieszko, held a   and created the   of   and the   of  ,  , and  . However, the pagan unrest led to the transfer of the capital to Kraków in 1038 by  . \n In 1109, Prince   defeated the King of Germany   at the  , stopping the German incursion into Poland. The clash between Bolesław III and Henry V was documented by   in  .  In 1138, Poland fragmented into several smaller duchies when Bolesław divided his lands among his sons. In 1226,  , one of the regional   dukes, invited the   to help him fight the     pagans; a decision that led to centuries of warfare with the Knights. In 1264, the   or the General Charter of Jewish Liberties introduced numerous right for the Jews in Poland, leading to a nearly autonomous \"nation within a nation\". \n In the middle of the 13th century, the Silesian branch of the Piast dynasty (  and  , ruled 1238–1241) nearly succeeded in uniting the Polish lands, but the   invaded the country from the east and defeated the combined Polish forces at the   where Duke Henry II the Pious died. In 1320, after a number of earlier unsuccessful attempts by regional rulers at uniting the Polish dukedoms,   consolidated his power, took the throne and became the first king of  . His son,   (reigned 1333–1370), has a reputation as one of the greatest Polish kings, and gained wide recognition for improving the country's infrastructure.  He also extended royal protection to  , and encouraged their immigration to Poland.  Casimir III realized that the nation needed a class of educated people, especially lawyers, who could codify the country's laws and administer the courts and offices. His efforts to create an institution of higher learning in Poland were finally rewarded when   granted him permission to open the  .\n The   of the nobles began to develop under Casimir's rule, when in return for their  , the king made a series of concessions to the nobility, and establishing their legal status as superior to that of the townsmen. When Casimir the Great died in 1370, leaving no legitimate male heir, the   came to an end.\n During the 13th and 14th centuries, Poland became a destination for German, Flemish and to a lesser extent Walloon, Danish and Scottish migrants. Also, Jews and Armenians began to settle and flourish in Poland during this era (see   and  ).\n The  , a plague that ravaged Europe from 1347 to 1351 did not significantly affect Poland, and the country was spared from a major outbreak of the disease.  The reason for this was the decision of Casimir the Great to quarantine the nation's borders.\n The   spanned the late   and early   of Polish history. Beginning with the     (Władysław II Jagiełło), the Jagiellon dynasty (1386–1572) formed the  . The partnership brought vast  -controlled   into Poland's sphere of influence and proved beneficial for the Poles and Lithuanians, who coexisted and cooperated in one of the largest   in Europe for the next four centuries. In the Baltic Sea region the struggle of Poland and Lithuania with the Teutonic Knights continued and culminated in the   (1410), where a combined Polish-Lithuanian army inflicted a decisive victory against them.  In 1466, after the  , King   gave royal consent to the  , which created the future  , a Polish vassal. The Jagiellon dynasty at one point also established dynastic control over the kingdoms of   (1471 onwards) and  .  In the south, Poland confronted the   and the   (by whom they were attacked on 75 separate occasions between 1474 and 1569),  and in the east helped Lithuania fight the  . Some historians estimate that Crimean Tatar slave-raiding cost Poland-Lithuania one million of its population between the years of 1494 and 1694. \n Poland was developing as a   state, with a predominantly agricultural economy and an increasingly powerful  . The   act adopted by the Polish   (parliament) in 1505, transferred most of the   from the monarch to the Sejm, an event which marked the beginning of the period known as \"Golden Liberty\", when the state was ruled by the \"free and equal\"  .   movements made deep inroads into Polish Christianity, which resulted in the establishment of policies promoting religious tolerance, unique in Europe at that time.  This tolerance allowed the country to avoid most of the religious turmoil that spread over Europe during the 16th century. \n The European   evoked in late Jagiellon Poland (kings   and  ) a sense of urgency in the need to promote a  , and during this period Polish culture and the nation's economy flourished. In 1543,  , an astronomer from  , published his epochal work   ( ), and thereby became the first proponent of a predictive mathematical model confirming the  , which became the accepted basic model for the practice of modern astronomy. Another major figure associated with the era is the classicist poet  . \n The 1569   established the  , a more closely unified federal state with an  , but which was governed largely by the nobility, through a system of   with a central parliament. The   (1573) guaranteed religious freedom for the Polish nobility   and townsfolk  . However, the     were still subject to severe limitations imposed on them by the nobility.  The establishment of the Commonwealth coincided with a period of stability and prosperity in Poland, with the union thereafter becoming a European power and a major cultural entity, occupying approximately one million square kilometers of Central and Eastern Europe, as well as an agent for the dissemination of   through   into areas of modern-day Lithuania, Ukraine, Belarus and Western Russia.\n In the 16th and 17th centuries,   suffered from a number of dynastic crises during the reigns of the   kings   and   and found itself engaged in major conflicts with  , Sweden and the Ottoman Empire, as well as a series of minor   uprisings.  In 1610, a Polish army under command     seized Moscow after winning the  . In 1611, the Tsar of Russia   to the King of Poland.\n After the signing of  , Poland had in the years 1618–1621 an area of about 1 million km  (390,000 sq mi).\n From the middle of the 17th century, the nobles' democracy, suffering from internal disorder, gradually declined, thereby leaving the once powerful Commonwealth vulnerable to foreign intervention. Starting in 1648, the     engulfed the south and east, eventually leaving Ukraine divided, with the eastern part, lost by the Commonwealth, becoming a dependency of the Tsardom of Russia. This was followed by the  , a Swedish invasion of Poland, which marched through the Polish heartlands and ruined the country's population, culture and infrastructure—around four million of Poland's eleven million inhabitants died in famines and epidemics throughout the 17th century.  However, under   the Commonwealth's military prowess was re-established, and in 1683 Polish forces played a major role in the   against the  , commanded by  , the Grand Vizier of the  .\n Sobieski's reign marked the end of the nation's golden era. Finding itself subjected to almost constant warfare and suffering enormous population losses as well as massive damage to its economy, the Commonwealth fell into decline. The government became ineffective as a result of large-scale internal conflicts (e.g.   against   and rebellious  ) and corrupted legislative processes. The nobility fell under the control of a handful of  , and this, compounded with two relatively weak kings of the    ,   and  , as well as the rise of   and   after the   only served to worsen the Commonwealth's plight. Despite this The Commonwealth-Saxony personal union gave rise to the emergence of the Commonwealth's first reform movement, and laid the foundations for the  . \n During the later part of the 18th century, the Commonwealth made attempts to implement fundamental internal reforms; with the second half of the century bringing a much improved economy, significant population growth and far-reaching progress in the areas of education, intellectual life, art, and especially toward the end of the period, evolution of the social and political system. The most populous capital city of Warsaw replaced   (Danzig) as the leading centre of commerce, and the role of the more prosperous townsmen increased.\n The   of 1764 resulted in the elevation of   (a Polish aristocrat connected to the   faction of  ) to the monarchy. However, as a one-time personal admirer of Empress  , the new king spent much of his reign torn between his desire to implement reforms necessary to save his nation, and his perceived necessity to remain in a political relationship with his Russian sponsor. This led to the formation of the 1768  , a   rebellion directed against the Polish king and his Russian sponsors, which aimed to preserve Poland's independence and the szlachta's traditional privileges.\nAttempts at reform provoked the union's neighbours, and in 1772 the   by Prussia, Russia and Austria took place; an act which the \" \", under considerable duress, eventually \"ratified\"  .  Disregarding this loss, in 1773 the king established the  , the first government education authority in Europe. Corporal punishment of children was officially prohibited in 1783.\n The   convened by Stanisław II August in 1788 successfully adopted the  , the first set of modern supreme national laws in Europe. However, this document, accused by detractors of harbouring revolutionary sympathies, generated strong opposition from the Commonwealth's nobles and conservatives as well as from Catherine II, who, determined to prevent the rebirth of a strong Commonwealth set about planning the final dismemberment of the Polish-Lithuanian state. Russia was aided in achieving its goal when the  , an organisation of Polish nobles, appealed to the Empress for help. In May 1792, Russian forces crossed the Commonwealth's frontier, thus beginning the  .\n The defensive war fought by the Poles ended prematurely when the King, convinced of the futility of resistance, capitulated and joined the Targowica Confederation. The Confederation then took over the government. Russia and Prussia, fearing the mere existence of a Polish state, arranged for, and in 1793 executed, the  , which left the country deprived of so much territory that it was practically incapable of independent existence. Eventually, in 1795, following the failed  , the Commonwealth was   by all three of its more powerful neighbours, and with this, effectively ceased to exist. \n Poles  , particularly near the end of the 18th century and the beginning of the 19th century. An unsuccessful attempt at defending Poland's sovereignty took place in 1794 during the  , where a popular and distinguished general  , who had several years earlier served under   in the  , led Polish insurrectionists against numerically superior Russian forces. Despite the victory at the  , his ultimate defeat ended Poland's independent existence  . \n In 1807,   temporarily recreated a Polish state as the satellite  , after a successful   against Prussian rule. But, after the failed  , Poland was again split between the victorious powers at the   of 1815.  The eastern part was ruled by the Russian   as  , which had a  . However, over time the Russian monarch reduced Polish freedoms, and Russia annexed the country in virtually all but name. Meanwhile, the Prussian controlled territory of Poland came under increased Germanization. Thus, in the 19th century, only Austrian-ruled  , and particularly the  , allowed free Polish culture to flourish.\n Throughout the period of the partitions, political and cultural repression of the Polish nation led to the organisation of a number of uprisings against the authorities of the occupying Russian, Prussian and Austrian governments. In 1830, the   began in Warsaw when, led by Lieutenant  , young   at the   in Warsaw revolted. They were joined by large segments of Polish society, and together forced Warsaw's Russian garrison to withdraw north of the city.\n Over the course of the next seven months, Polish forces successfully defeated the Russian armies of Field Marshal   and a number of other Russian commanders; however, finding themselves in a position unsupported by any other foreign powers, save distant France and the newborn United States, and with Prussia and Austria refusing to allow the import of military supplies through their territories, the Poles accepted that the uprising was doomed to failure. Upon the surrender of Warsaw to General  , many Polish troops, feeling they could not go on, withdrew into Prussia and there laid down their arms. After the defeat, the semi-independent Congress Poland lost its constitution, army and legislative assembly, and was integrated more closely with the Russian Empire. \n During the   (a series of revolutions which swept across Europe), Poles took up arms in the   to resist Prussian rule. Initially, the uprising manifested itself in the form of civil disobedience, but eventually turned into an armed struggle when the Prussian military was sent in to pacify the region. Eventually, after several battles the uprising was suppressed by the Prussians, and the   was more completely incorporated into Prussia. \n In 1863, a new Polish uprising against Russian rule began. The   started out as a spontaneous protest by young Poles against   into the Imperial Russian Army. However, the insurrectionists, despite being joined by high-ranking Polish-Lithuanian officers and numerous politicians, were still severely outnumbered and lacking in foreign support. They were forced to resort to guerrilla warfare tactics and failed to win any major military victories. Afterwards no major uprising was witnessed in the Russian-controlled Congress Poland, and Poles resorted instead to fostering economic and cultural self-improvement. Congress Poland was rapidly industrialised towards the end of the 19th century, and successively transformed into the Empire's wealthiest and most developed subject. \n Despite the political unrest experienced during the partitions, Poland did benefit from large-scale industrialisation and modernisation programs, instituted by the occupying powers, which helped it develop into a more economically coherent and viable entity. This was particularly true in Greater Poland, Silesia and Eastern Pomerania controlled by Prussia (later becoming a part of the  ); areas which eventually, thanks largely to the   and  , were reconstituted as a part of the  , becoming the country's most prosperous regions. \n During  , all the   agreed on the reconstitution of Poland that United States President   proclaimed in Point 13 of his  . A total of 2 million Polish troops fought with the armies of the three occupying powers, and 450,000 died. Shortly after the  , Poland regained its independence as the   ( ). It reaffirmed its independence after  , the most notable being the   (1919–21) when Poland inflicted a crushing defeat on the   at the  , an event which is considered to have halted the advance of Communism into Europe and forced   to rethink his objective of achieving global socialism. The event is often referred to as the \"Miracle at the Vistula\". \n During this period, Poland successfully managed to fuse the territories of the three former partitioning powers into a cohesive nation state. Railways were restructured to direct traffic towards   instead of the former imperial capitals, a new network of national roads was gradually built up and a   was opened on the   Coast, so as to allow Polish exports and imports to bypass the politically charged  .\n The inter-war period heralded in a new era of Polish politics. Whilst Polish political activists had faced heavy censorship in the decades up until the First World War, the country now found itself trying to establish a new political tradition. For this reason, many exiled Polish activists, such as   (who would later become prime minister) returned home to help; a significant number of them then went on to take key positions in the newly formed political and governmental structures. Tragedy struck in 1922 when  , inaugural holder of the presidency, was assassinated at the   Gallery in Warsaw by painter and right-wing nationalist  . \n In 1926, a  , led by the hero of the Polish independence campaign Marshal  , turned rule of the Second Polish Republic over to the nonpartisan   ( ) movement in an effort to prevent radical political organizations on both the left and the right from destabilizing the country.  The movement functioned integrally until Piłsudski's death in 1935. Following Marshall Piłsudski's death, Sanation split into several competing factions.  By the late 1930s, Poland's government had become increasingly rigid; with a number of radical political parties that threatened the stability of the country such as the   banned. \n As a subsequent result of the   in 1938, Czechoslovakia ceded to Poland the small 350 sq mi   region. The area was a point of contention between the Polish and Czechoslovak governments in the past and the two countries  . \n  began with the     on 1 September 1939, followed by the   on 17 September. On 28 September 1939,  . As agreed in the  , Poland was split into two zones,  , the other by  . In 1939–41, the Soviets deported hundreds of thousands of Poles. The Soviet   executed thousands of Polish prisoners of war (inter alia  ) ahead of the  .  German planners had in November 1939 called for \"the complete destruction\" of all Poles and their fate, as well as many other  , as outlined in the genocidal  . \n Polish intelligence operatives proved extremely valuable to the Allies, providing much of the intelligence from Europe and beyond,  and   were responsible for  . \n Poland made the fourth-largest troop contribution in Europe  and its troops served both the   in the   and Soviet leadership in the  . Polish troops played an important role in the  ,   and   and are particularly remembered for the  .  In the east, the Soviet-backed   distinguished itself in the battles for   and  . \n During the   Polish squadrons such as the   achieved considerable success. \n The  , and the   ( ), fought against German occupation. It was one of the three largest resistance movements of the entire war,  and encompassed a range of clandestine activities, which functioned as an   complete with   and  .  The resistance was loyal to the exiled government and generally resented the idea of a communist Poland; for this reason, in the summer of 1944 it initiated  , of which the   that begun on 1 August 1944 is the best known operation. \n Nazi German forces under orders from   set up six German   in occupied Poland, including  ,   and  . The Germans   from across occupied Europe to be murdered in those camps. \n Altogether, 3 million Polish Jews  - approximately 90% of Poland's pre-war Jewry - and between 1.8 and 2.8 million ethnic Poles  were killed during the German  , including between 50,000 and 100,000 members of the Polish   - academics, doctors, lawyers, nobility and priesthood.  Around 150,000 Polish civilians were killed by Soviets between 1939 and 1941 during the Soviet Union's occupation of eastern Poland ( ), and another estimated 100,000 Poles were murdered by the   (UPA) between 1943 and 1944 in what became known as the  .    in the war, Poland lost the highest percentage of its citizens: around 6 million perished – more than one-sixth of Poland's pre-war population –   Polish Jews.  About 90% of deaths were non-military in nature. \n In 1945, Poland's borders  . Over two million Polish inhabitants of     along the   by Stalin.  The western border became the  . As a result, Poland's territory was reduced by 20%, or 77,500 square kilometres (29,900 sq mi). The shift forced the migration of  , most of whom were Poles, Germans, Ukrainians, and Jews. \n At the insistence of  , the   sanctioned the formation of a new provisional pro-Communist coalition government in Moscow, which ignored the   based in London. This action angered many Poles who considered it a   by the Allies. In 1944, Stalin had made guarantees to   and   that he would maintain Poland's sovereignty and allow democratic elections to take place. However, upon achieving victory in 1945, the elections organized by the occupying Soviet authorities were falsified and were used to provide a veneer of legitimacy for Soviet hegemony over Polish affairs. The Soviet Union instituted a new   government in Poland, analogous to much of the rest of the  .  , the Soviet occupation of Poland met with   from the outset which continued into the Fifties.\n Despite widespread objections, the new Polish government accepted the Soviet annexation of the pre-war eastern regions of Poland  (in particular the cities of   and  ) and agreed to the permanent garrisoning of   units on Poland's territory. Military alignment within the   throughout the   came about as a direct result of this change in Poland's political culture. In the European scene, it came to characterize the full-fledged integration of Poland into the brotherhood of communist nations.\n The   ( )  . In 1956, after the death of  , the régime of   became temporarily more liberal, freeing many people from prison and expanding some personal freedoms.   failed. A similar situation repeated itself in the 1970s under  , but most of the time persecution of   groups persisted. Despite this, Poland was at the time considered to be one of the least oppressive states of the  . \n Labour turmoil in 1980 led to the formation of the independent trade union \" \" (\" \"), which over time became a political force. Despite persecution and imposition of  , it eroded the dominance of the   and by 1989 had triumphed in Poland's first   since the end of the Second World War.  , a Solidarity candidate, eventually  . The Solidarity movement heralded the  .\n A   programme, initiated by   in the early 1990s, enabled the country to transform its socialist-style planned economy into a  . As with other post-communist countries, Poland suffered declines in social and economic standards,  but it became the first post-communist country to reach its pre-1989 GDP levels, which it achieved by 1995 thanks largely to its booming economy. \n Most visibly, there were numerous improvements in human rights, such as  ,   (no censorship), civil liberties (1st class) and political rights (1st class), as ranked by   non-governmental organization. In 1991, Poland became a member of the   and joined the   (NATO) alliance in 1999 along with the   and  . Poles then voted to join the   in   in June 2003, with   on 1 May 2004.\n Poland joined the   in 2007, as a result of which,   with other member states of the European Union have been dismantled, allowing for   within most of the EU.  In contrast to this, a section of Poland's eastern border now constitutes the external EU border with  , Russia and Ukraine. That border has become increasingly well protected, and has led in part to the coining of the phrase  , in reference to the seeming 'impossibility' of gaining entry to the EU for citizens of the  .\n In an effort to strengthen military cooperation with its neighbors, Poland set up the   with Hungary, Czech Republic and Slovakia, with a total of 3,000 troops ready for deployment. Also, in east Poland, it formed the   battle groups with Lithuania and Ukraine. These battle groups will operate outside of NATO and within the European defense initiative framework. \n On 10 April 2010, the President of the Republic of Poland,  , along with 89 other high-ranking Polish officials   near  , Russia. The president's party was on their way to attend an annual service of commemoration for the victims of the   when the tragedy took place.\n In 2011, the ruling   won  . Poland joined the   in 2012, as well as organised the   (along with Ukraine). In 2013, Poland also became a member of the  . In 2014, the  ,  , was chosen to be  , and resigned as prime minister. The 2015 elections were won by the opposition   Party (PiS). \n Poland's territory extends across several geographical regions, between latitudes   and  , and longitudes   and  . In the north-west is the   seacoast, which extends from the   to the  . This coast is marked by several  , coastal lakes (former bays that have been cut off from the sea), and dunes. The largely straight coastline is indented by the  , the  , and the  .\n The centre and parts of the north of the country lie within the  . Rising above these lowlands is a geographical region comprising four hilly districts of   and   formed during and after the  . These lake districts are the   Lake District, the Greater Polish Lake District, the   Lake District, and the  . The Masurian Lake District is the largest of the four and covers much of north-eastern Poland. The lake districts form part of the Baltic Ridge, a series of moraine belts along the southern shore of the  .\n South of the Northern European Plain are the regions of  ,   and  , which are marked by broad ice-age river valleys. Farther south is a mountainous region, including the  , the  , the  , and the  , including the  . The highest part of the Carpathians is the  , along Poland's southern border.\n The geological structure of Poland has been shaped by the   of Europe and Africa over the past 60 million years and, more recently, by the   glaciations of northern Europe. Both processes shaped the   and the  . The moraine landscape of northern Poland contains soils made up mostly of sand or  , while the ice age river valleys of the south often contain  . The  , the  , and the   consist of  , while the  , the  , and the   are made up mainly of   and  . The   has some of the oldest rock formation on the continent of Europe.\n Poland has 70 mountains over 2,000 metres (6,600 feet) in elevation, all in the  . The Polish Tatras, which consist of the High Tatras and the Western Tatras, is the highest mountain group of Poland and of the entire Carpathian range. In the High Tatras lies Poland's highest point, the north-western summit of  , 2,499 metres (8,199 ft) in elevation. At its foot lie the mountain lakes of   (Black Lake below Mount Rysy) and   (the Eye of the Sea), both naturally-made  . \n The second highest mountain group in Poland is the  , whose highest peak is  , at 1,725 metres (5,659 ft). The next highest mountain groups are the   in the  , the highest point of which is   at 1,603 metres (5,259 ft), and the  , the highest point of which is   at 1,425 metres (4,675 ft).\n Other notable uplands include the  , which are noted for their interesting rock formations, the   in the far southeast of the country, in which the highest Polish peak is   at 1,346 metres (4,416 ft), the   in  , whose highest point is   at 1,310 metres (4,298 ft), the   in  , the highest point of which is Wysokie Skałki (Wysoka) at 1,050 metres (3,445 ft), and the   in  , which have two similarly high peaks:   at 612 metres (2,008 ft) and   at 593 metres (1,946 ft).\n The lowest point in Poland – at 1.8 metres (5.9 ft) below sea level – is at  , near   in the Vistula Delta.\n In the   (the Coal Fields of  ) region in the   in southern Poland is an area of sparsely vegetated sand known as the  . It covers an area of 32 square kilometres (12 sq mi). It is not a natural desert but results from human activity from the   onwards.\n The Baltic Sea activity in   created   which in the course of time separated the bay from the sea creating two lakes. As waves and wind carry sand inland the dunes slowly move, at a rate of 3 to 10 metres (9.8 to 32.8 ft) per year. Some dunes reach the height of up to 30 metres (98 ft). The highest peak of the park is Rowokol (115 metres or 377 feet  ).\n The longest rivers are the   ( :  ), 1,047 kilometres (651 mi) long; the   ( :  ) which forms part of Poland's western border, 854 kilometres (531 mi) long; its tributary, the  , 808 kilometres (502 mi) long; and the  , a tributary of the Vistula, 772 kilometres (480 mi) long. The Vistula and the Oder flow into the  , as do numerous smaller rivers in Pomerania. \n The   and the   flow by way of the   to the Baltic Sea, and the   flows into the Baltic Sea through the  . While the great majority of Poland's rivers drain into the Baltic Sea, Poland's Beskids are the source of some of the upper tributaries of the  , which flows via the   and the   to the  . The eastern Beskids are also the source of some streams that drain through the   to the Black Sea.\n Poland's rivers have been used since early times for navigation. The  , for example, traveled up the Vistula and the Oder in their  . In the Middle Ages and in early modern times, when the Polish–Lithuanian Commonwealth was the breadbasket of Europe;  the shipment of grain and other agricultural products down the Vistula toward   and onward to other parts of Europe took on great importance. \n In the valley of   river in   there is a unique natural   of water containing calcium salts, that is an object of protection in   in  . The origin of the name of the reserve  , that means  , comes from the fact that red waves are absorbed by water and only blue and green are reflected from the bottom of the spring, giving that atypical colour. \n With almost ten thousand closed bodies of water covering more than 1 hectare (2.47 acres) each, Poland has one of the highest numbers of lakes in the world. In Europe, only   has a greater density of lakes.  The largest lakes, covering more than 100 square kilometres (39 sq mi), are   and   in  , and   and   in  .\n In addition to the lake districts in the north (in Masuria, Pomerania,  , Lubuskie, and  ), there are also many mountain lakes in the Tatras, of which the Morskie Oko is the largest in area. The lake with the greatest depth—of more than 100 metres (328 ft)—is   in the Wigry Lake District, east of Masuria in  .\n Among the first lakes whose shores were settled are those in the Greater Polish Lake District. The   settlement of  , occupied by more than one thousand residents, was founded before the 7th century BC by people of the  .\n Lakes have always played an important role in Polish history and continue to be of great importance to today's modern Polish society. The ancestors of today's Poles, the  , built their first fortresses on islands in these lakes. The legendary Prince   ruled from   tower erected on the  .  The first historically documented ruler of Poland, Duke  , had his palace on an island in the Warta River in  . Nowadays the Polish lakes provide a location for the pursuit of water sports such as   and  .\n The Polish Baltic coast is approximately 528 kilometres (328 mi) long and extends from   on the islands of   and   in the west to   on the   in the east. For the most part, Poland has a smooth coastline, which has been shaped by the continual movement of sand by currents and winds. This continual   and   has formed cliffs, dunes, and spits, many of which have migrated landwards to close off former lagoons, such as Łebsko Lake in Słowiński National Park.\n The largest spits are   and the  . The coast line is varied also by   and   and a few lakes, e.g.   and  . The largest Polish Baltic island is called   known for its  . The largest sea   are  ,  ,  ,  ,   and   and the main coastal resorts –  ,  ,  ,  ,  ,   and the Hel Peninsula.\n Forests cover about 30.5% of Poland's land area based on international standards.  Its overall percentage is still increasing.   are managed by the national program of reforestation (KPZL), aiming at an increase of forest-cover to 33% in 2050. The richness of Polish forest (per SoEF 2011 statistics)  is more than twice as high as European average (with Germany and France at the top), containing 2.304 billion cubic metres of trees.  The largest forest complex in Poland is  .\n More than 1% of Poland's territory, 3,145 square kilometres (1,214 sq mi), is protected within 23  . Three more national parks are projected for  , the Polish Jura, and the eastern  . In addition,   along lakes and rivers in central Poland are legally protected, as are coastal areas in the north. There are over 120 areas designated as  , along with numerous   and other   (e.g.  ).\n Since Poland's accession to the European Union in 2004, Polish agriculture has performed extremely well and the country has over two million private farms.  It is the leading producer in Europe of potatoes and   (world's second largest in 1989) the world's largest producer of  ,  and one of the more important producers of barley, oats,  , flax, and fruits. Poland is the European Union's fourth largest supplier of pork after Germany, Spain and France. \n , Poland belongs to the Central European province of the   within the  . According to the  , the territory of   of the continental forest spanning Central and Northern European   ecoregions as well as the Carpathian   conifer forest.\n Many animals that have since died out in other parts of Europe still survive in Poland, such as the   in the   of the   and in  . Other such species include the   in  , in the Tatras, and in the Beskids, the   and the   in various forests, the   in northern Poland, and the   in Masuria, Pomerania, and Podlaskie.\n In the forests there are game animals, such as  ,   and  . In eastern Poland there are a number of ancient woodlands, like Białowieża forest, that have never been cleared or disturbed much by people. There are also large forested areas in the mountains, Masuria, Pomerania,   and  .\n Poland is the most important breeding ground for a variety of European  .  One quarter of the global population of   (40,000 breeding pairs) live in Poland,  particularly in the lake districts and the wetlands along the  , the  , and the  , which are part of nature reserves or national parks.\n Poland has historically been home to the two largest European species of mammals —   ( ) and   ( ). Both survived in Poland longer than anywhere else. The last aurochs of Europe became extinct in 1627, in the  , while   survived until the   only in the  , but have been reintroduced to other countries since.\n The climate is mostly   throughout the country. The climate is   in the north and west and becomes gradually warmer and   towards the south and east. Summers are generally warm, with average temperatures between 18 and 30 °C (64.4 and 86.0 °F) depending on the region. Winters are rather cold, with average temperatures around 3 °C (37.4 °F) in the northwest and −6 °C (21 °F) in the northeast.   falls throughout the year, although, especially in the east, winter is drier than summer. \n The warmest region in Poland is   in the southwest of the country, where temperatures in the summer average between 24 and 32 °C (75 and 90 °F) but can go as high as 34 to 39 °C (93.2 to 102.2 °F) on some days in the warmest months of July and August. The warmest cities in Poland are   in  , and   in Lower Silesia. The average temperatures in Wrocław are 20 °C (68 °F) in the summer and 0 °C (32.0 °F) in the winter, but   has the longest summer in all of Poland, which lasts for 115 days, from mid-May to mid-September. The coldest region of Poland is in the northeast in the   near the borders with   and  . Usually the coldest city is  . The climate is affected by   which come from   and  . The average temperature in the winter in Podlaskie ranges from −6 to −4 °C (21 to 25 °F). The biggest impact of the   is observed in   and   seashore area from   to  . \n Poland is a  , with a   as a  , whose current   dates from 1997.  The government structure centers on the  , led by a  . The president appoints the cabinet according to the proposals of the prime minister, typically from the majority coalition in the  . The president is elected by popular vote every five years. The current   is   and the   is  . \n Polish voters elect a   parliament consisting of a 460-member lower house (Sejm) and a 100-member Senate ( ). The Sejm is elected under   according to the  , a method similar to that used in many parliamentary political systems. The Senat, on the other hand, is elected under the   method, with one senator being returned from each of the 100 constituencies. \n With the exception of ethnic minority parties, only candidates of   receiving at least 5% of the total national vote can enter the Sejm. When sitting in joint session, members of the Sejm and Senat form the   (the  ). The National Assembly is formed on three occasions: when a new president takes the  ; when an indictment against the President of the Republic is brought to the State Tribunal ( ); and when a president's permanent incapacity to exercise his duties due to the state of his health is declared. To date only the first instance has occurred. \n The   plays an important role in decision-making. Its major institutions include the   ( ); the   ( ); the   ( ); and the   ( ). On the approval of the Senat, the Sejm also appoints the   or the Commissioner for Civil Rights Protection ( ) for a five-year term. The ombudsman has the duty of guarding the observance and implementation of the rights and liberties of Polish citizens and residents, of the law and of principles of community life and social justice. \n The   is the supreme law in contemporary Poland, and the Polish legal system is based on the principle of civil rights, governed by the code of Civil Law. Historically, the most famous Polish legal act is the  . Historian   describes it as the first of its kind in Europe.  The Constitution was instituted as a   ( :  ) and then adopted on 3 May 1791 by the   of the  . Primarily, it was designed to redress long-standing political defects of the   Polish–Lithuanian Commonwealth and its  . Previously only the   signed by each of Poland's elected kings could perform the function of a set of basic laws.\n The new Constitution introduced political equality between   and the   ( ), and placed the   under the protection of the government. The Constitution abolished pernicious parliamentary institutions such as the  , which at one time had placed the   at the mercy of any deputy who might choose, or be   by an interest or foreign power, to have rescinded all the legislation that had been passed by that sejm. The 3 May Constitution sought to supplant the existing anarchy fostered by some of the country's    , with a more   and democratic  . The adoption of   was treated as a threat by Poland's neighbours.  In response  , Austria and Russia formed an anti-Polish alliance and over the next decade collaborated with one another to   their weaker neighbour and destroyed the Polish state. In the words of two of its co-authors,   and  , the constitution represented \"the last will and testament of the expiring Fatherland.\" Despite this, its text influenced many later   across the globe.  In Poland, freedom of expression is guaranteed by the Article 25 (section I. The Republic) and Article 54 (section II. The Freedoms, Rights and Obligations of Persons and Citizens) of the  .\n  started in the 1800s in the age of the foreign Partitions. Poland's precursor of feminism,  , founded a group of   in 1842. Prior to the   in 1795, tax-paying females were allowed to take part in political life. Since 1918, following the return to independence, all women could vote. Poland was the 15th (12th sovereign) country to introduce universal women's suffrage. Currently, in Poland abortion is allowed only in special circumstances, such as when the woman's life or health is endangered by the continuation of pregnancy, when the pregnancy is a result of a criminal act, or when the fetus is seriously malformed.  Homosexuality in Poland was confirmed as legal in 1932. Also, Poland recognises gender change.  Trafficking women is 'illegal and rare' (top results worldwide). \n Poland's current constitution was adopted by the   on 2 April 1997, approved by a national referendum on 25 May 1997, and came into effect on 17 October 1997. It guarantees a multi-party state, the freedoms of religion, speech and assembly, and specifically casts off many Communist ideals to create a '   '. It requires public officials to pursue ecologically sound public policy and acknowledges the inviolability of the home, the right to form trade unions, and to strike, whilst at the same time prohibiting the practices of forced medical experimentation, torture and corporal punishment.\n In recent years, Poland has extended its responsibilities and position in European and international affairs, supporting and establishing friendly relations with other European nations and many 'developing' countries.\n Poland is a member of the  ,  , the  , the  , the   (OECD),  ,  ,  ,  ,  ,  ,  ,  ,  ,   and  .\n In 1994, Poland became an associate member of the European Union (EU) and its defensive arm, the   (WEU), having submitted preliminary documentation for full membership in 1996, it formally joined the European Union in May 2004, along with the other members of the  . In 1996, Poland achieved full   membership, and at the 1997 Madrid Summit was invited to join the   (NATO) in the first wave of   finally becoming a full member of NATO in March 1999.\n As changes since the fall of Communism in 1989 have redrawn the map of Europe, Poland has tried to forge strong and mutually beneficial relationships with its seven new neighbours, this has notably included signing 'friendship treaties' to replace links severed by the collapse of the  . Poland has forged a special relationships with  ,  with whom it co-hosted the UEFA   football tournament, in an effort to firmly anchor the country within the Western world and provide it with an alternative to aligning itself with the  . Despite many positive developments in the region, Poland has found itself in a position where it must seek to defend the rights of ethnic Poles living in the  ; this is particularly true of  , where in 2005 the   regime launched a campaign against the Polish ethnic minority. \n Poland is the   of the European Union and has a grand total of 51 representatives in the  . Ever since joining the union in 2004, successive Polish governments have pursued policies to increase the country's role in European and regional affairs.\n Poland's current   (provinces) are largely based on the country's historic regions, whereas those of the past two decades (to 1998) had been centred on and named for individual cities. The new units range in area from less than 10,000 square kilometres (3,900 sq mi) for Opole Voivodeship to more than 35,000 square kilometres (14,000 sq mi) for Masovian Voivodeship. Administrative authority at voivodeship level is shared between a government-appointed   (governor), an elected regional assembly ( ) and a voivodeship marshal, an executive elected by that assembly.\n The voivodeships are subdivided into   (often referred to in English as counties), and these are further divided into   (also known as communes or municipalities). Major cities normally have the status of both   and  . Poland has 16 voivodeships, 380 powiats (including 66 cities with   status), and 2,478  .\n The Polish armed forces are composed of five branches:   ( ),   ( ),   ( ),   ( ) and   ( ) – a military component of the Polish armed forces created of 2016. Plans call for the force, once fully active, to consist of 53,000 people who will be trained and equipped to counter potential   threats.  The military is subordinate to the  . However, its commander-in-chief is the President of the Republic.\n The Polish army's size is estimated at around 101,500 soldiers (2016). The Polish Navy primarily operates in the Baltic Sea and conducts operations such as maritime patrol, search and rescue for the section of the Baltic under Polish sovereignty, as well as hydrographic measurements and research. Also, the Polish Navy played a more international role as part of the  , providing logistical support for the  . The current position of the Polish Air Force is much the same; it has routinely taken part in   assignments, but otherwise, with the exception of a number of units serving in  , has seen no active combat. In 2003, the   Block 52 was chosen as the new general multi-role fighter for the air force, the first deliveries taking place in November 2006.\n The most important mission of the armed forces is the defence of Polish territorial integrity and Polish interests abroad.  Poland's national security goal is to further integrate with   and European defence, economic, and political institutions through the modernisation and reorganisation of its military.  The armed forces are being re-organised according to NATO standards, and since 2010, the transition to an entirely contract-based military has been completed. Compulsory military service for men was discontinued in 2008. From 2007, until conscription ended in 2008, the mandatory service was nine months. \n Polish military doctrine reflects the same defensive nature as that of its NATO partners. From 1953 to 2009 Poland was a large contributor to various United Nations peacekeeping missions.  The Polish Armed Forces took part in the  , deploying 2,500 soldiers in the south of that country and commanding the 17-nation  .\n The military was temporarily, but severely, affected by the  , which killed the Chief of the Army's General Staff   and Air Force commanding general  , among others. \n Currently, Poland's military is going through a significant modernization phase, which will be completed in 2022. The government plans to spend up to 130 billion złoty (US$34 billion), however the final total may reach 235 billion złoty (US$62 billion) to replace dated equipment and purchase new weapons systems.  Under the program, the military plans to purchase new tracked  , self-propelled  ,   and   helicopters, a mid-range   system,  ,  , and coastal  . Also, the army plans to modernize its existing inventory of  , and update its stock of  .  Poland is currently spending 2% of its GDP on defense, and is expected to grow to 2.5% of GDP by 2030. In May 2017 the   has assured that the Polish army will be increased to 250,000 active personnel.\n Poland has a highly developed system of law enforcement with a long history of effective policing by the   (Policja). The structure of law enforcement agencies within Poland is a multi-tier one, with the State Police providing criminal-investigative services,   serving to maintain public order and a number of other specialized agencies, such as the  , acting to fulfill their assigned missions. In addition to these state services, private security companies are also common, although they possess no powers assigned to state agencies, such as, for example, the power to make an arrest or detain a suspect.\n Emergency services in Poland consist of the  ,   units of the   and  . Emergency medical services in Poland are, unlike other services, provided for by local and regional government.\n Since joining the European Union all of Poland's emergency services have been undergoing major restructuring and have, in the process, acquired large amounts of new equipment and staff.  All emergency services personnel are now uniformed and can be easily recognised. In addition, the police and other agencies have been steadily replacing and modernising their fleets of vehicles. \n Poland's economy is considered to be one of the more resilient of the post-Communist countries and is one of the fastest growing within the EU.  Having a strong domestic market, low private debt, low unemployment rate, flexible currency, and not being dependent on a single export sector, Poland is the only European economy to have avoided the  .  Since the  , Poland has pursued a policy   the economy. It is an example of the transition from a   to a primarily  . The country's most successful exports include machinery, furniture, food products, clothing, shoes and cosmetics.  Poland's largest trading partners include Germany, Czech Republic, United Kingdom, France and Italy.  According to   data, Polish GDP per capita in PPS stood at 71% of the EU average in 2018, up from 50% in the year prior to the accession to the EU in 2004. \n The Polish banking sector is the largest in the Central and Eastern European region,  with 32.3 branches per 100,000 adults.  The banks are the largest and most developed sector of the country's  . They are regulated by the  . During the transformation to a market-oriented economy, the government privatized several banks, recapitalized the rest, and introduced legal reforms that made the sector more competitive. This has attracted a significant number of strategic foreign investors (ICFI). Poland's banking sector has approximately 5 national banks, a network of nearly 600 cooperative banks and 18 branches of foreign-owned banks. In addition, foreign investors have controlling stakes in nearly 40 commercial banks, which make up 68% of the banking capital. \n Poland has many private farms in its agricultural sector, with the potential to become a leading producer of food in the European Union. The biggest money-makers abroad include smoked and fresh fish, fine chocolate, and dairy products, meats and specialty breads,  with the exchange rate conducive to export growth.  Food exports amounted to 62 billion   in 2011, increasing by 17% from 2010.   Structural reforms in health care, education, the pension system, and state administration have resulted in larger-than-expected fiscal pressures. Warsaw leads Central Europe in foreign investment. \n Since the gradual opening of the   labor market from 2004, Poland has had   of over 2.3 million, due to higher wages abroad and mass   at home, even as Poland avoided the   of 2008.  The emigration has increased the average wages for the workers who remained in Poland, in particular for those with intermediate level skills.  Unemployment also gradually decreased; in September 2018 the unemployment rate in Poland was estimated at 5.7%, one of the lowest in the European Union.  In 2019, Poland passed a law that would exempt workers under the age of 26 from income tax. \n Products and goods manufactured in Poland include: electronics, buses and trams ( ,  ), helicopters and planes ( ,  ), trains ( ,  ), ships ( ,  ,  ), military equipment ( ,  ), medicines ( ,  ), food ( ,  ,  ), clothes ( ), glass, pottery ( ), chemical products and others. Poland is also one of the world's biggest producers of  ,   and  , as well as  ,  ,  ,  ,  ,   and  . \n Poland is recognised as a regional economic leader within Central Europe, with nearly 40 percent of the 500 biggest companies in the region (by revenues) as well as a  .  The country's largest firms compose the   index, which is traded on the  .\n The economic transition in 1989 has resulted in a   in the number and value of investments conducted by Polish corporations abroad. Over a quarter of these companies have participated in a foreign project or  , and 72 percent decided to continue foreign expansion. According to reports made by the  , the value of Polish foreign direct investments reached almost 300 billion   at the end of 2014. The   estimated that in 2014 there were around 1,437 Polish corporations with interests in 3,194 foreign entities. \n Well known Polish brands include, among others  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,   (PKP),  , and  . \n The list includes the largest companies by turnover in 2016:\n Poland experienced an increase in the number of tourists after joining the European Union in 2004.  Tourism contributes significantly to the overall economy and makes up a relatively large proportion of the country's service market. \n Tourist attractions in Poland vary, from the mountains in the south to the sandy beaches in the north, with a trail of nearly every architectural style. The most visited city is  , which was the former capital of Poland and serves as a relic of   of Renaissance. Kraków also held   of  . Among other notable sites in the country is  , one of the oldest cities in Poland. Wrocław possesses a huge market square with two  , as well as the oldest   with one of the world's largest number of animal species and is famous for its  . The Polish capital   and its historical   were entirely reconstructed after  .  Other cities attracting tourists include  ,  ,  ,  ,   and the historic site of the     in  .\n Poland's main tourist offerings include outdoor activities such as skiing, sailing, mountain hiking and climbing, as well as agrotourism, sightseeing  . Tourist destinations include the   coast in the north; the   and   in the east; on the south  , the   and the  , where  , the highest peak of Poland, and the famous   mountain trail are located. The   and   lie in the extreme south-east.  There are   in the country, many in the   and along the popular  . \n The electricity generation sector in Poland is largely  –based. Many power plants nationwide use Poland's position as a major European exporter of coal to their advantage by continuing to use coal as the primary raw material in production of their energy. In 2013, Poland scored 48 out of 129 states in the Energy Sustainability Index.  The three largest Polish coal mining firms ( ,   and  ) extract around 100 million tonnes of coal annually. All three of these companies are key constituents of the  's lead economic indexes.\n  account for a smaller proportion of Poland's full energy generation capacity.  However, the national government has set targets for the development of renewable energy sources in Poland which should see the portion of power produced by renewable resources climb to 15% in 2020 (in 2017 it was 10.9%). This is to be achieved mainly through the construction of   and a number of   stations.\n Poland has around 164,800,000,000 m  of proven natural gas reserves and around 96,380,000 barrels of proven oil reserves. These reserves are exploited by energy supply companies such as   (\"the only Polish company listed in the  \"),  . However, the small amounts of fossil fuels naturally occurring in Poland is insufficient to satisfy the full energy consumption needs of the population. Therefore, the country is a net importer of oil and natural gas.\n The 5 largest companies supplying Poland electricity are  ,  ,  ,   and  .\n Transport in Poland is provided by means of  ,  ,   and  . Positioned in Central Europe with its eastern and part of its northeastern border constituting the longest land border of the   with the rest of   and  .\n Since joining the EU in May 2004, Poland has invested large amounts of public funds into modernization projects of its transport networks. The country now has a developing network of  , composed of   and  . At the end of 2017, Poland had 3,421.7 km (2,126.1 mi) of highways. In addition to these newly built roads, many local and regional roads are being fixed as part of a national programme to rebuild all roads in Poland. \n In 2015, the nation had 19,000 kilometres (11,800 mi) of railway track. Polish authorities maintain a program of improving operating speeds across the entire Polish rail network. To that end,   (PKP) is adopting new rolling stock which is in principle capable of speeds up to 200 km/h (124 mph). Additionally, in December 2014, Poland began to implement   connecting major Polish cities. The Polish government has revealed that it intends to connect all major cities to a future high-speed rail network by 2020.  The new PKP   test train set the record for the fastest train in the history of Poland, reaching 291 km/h (181 mph) on 24 November 2013. Poland is gradually implementing the  . Polish regulations allow trains without   to travel at speeds up to 160 km/h, trains with ETCS1 up to 200 km/h, and trains with ETCS2 over 200 km/h. Most interregional connections rail routes in Poland is operated by  , whilst regional trains are run by a number of operators, the largest of which is  .\n On 14 December 2014, Polish State Railways started passenger service using the PKP  , operating at 200 km/h speed on 80 km (50 mi) of line between Olszamowice and Zawiercie (part of the   [CMK]). Currently, the whole CMK and on several other lines is adapted to the speed of 200 km/h.\n The air and maritime transport markets in Poland are largely well developed. Poland has a number of international airports, the largest of which is  , the primary global hub for  . It was established in 1929 from a merger of   (1922) and   (1925). Other major airports with international connections include  ,  ,  . Poland has begun preparations for a construction that can handle 100 million passengers of the  .\n Seaports exist all along Poland's Baltic coast, with most freight operations using  ,  ,  ,  ,  ,   and   as their base.\nPassenger ferries link Poland with   all year round; these services are provided from Gdańsk and Świnoujście by  ,   from Gdynia and   from the Świnoujście. The   is the only port in the   adapted to receive oceanic vessels.\n Over the course of history, the Polish people have made considerable contributions in the fields of science, technology and mathematics.  Perhaps the most renowned Pole to support this theory was   ( ), who triggered the   by placing the  .  He also derived a  , which made him a pioneer of economics. Copernicus' achievements and discoveries are considered the basis of Polish culture and cultural identity. \n Poland's tertiary education institutions; traditional  , as well as technical, medical, and economic institutions, employ around 61,000 researchers and members of staff.  There are around 300 research and development institutes, with about 10,000 researchers.  In total, there are around 91,000 scientists in Poland today.  However, in the 19th and 20th centuries many Polish scientists worked abroad; one of the most important of these exiles was  , a physicist and chemist who lived much of her life in France. In 1925 she established Poland's  . \n In the first half of the 20th century, Poland was a flourishing centre of mathematics. Outstanding Polish mathematicians formed the   (with  ,  ,  ,  ) and   (with  ,  ,   and  ).\n Over 40 research and development centers and 4,500 researchers make Poland the biggest research and development hub in Central and Eastern Europe.  Multinational companies such as: ABB,  ,  ,  ,  ,  ,  ,  ,  ,  ,   and   all have set up research and development centres in Poland.  Companies chose Poland because of the availability of highly qualified labour force, presence of universities, support of authorities, and the largest market in East-Central Europe.  According to a   report from 2011, 80% of Poland's current investors are content with their choice and willing to reinvest. \n The public postal service in Poland is operated by   (the Polish Post). It was created on 18 October 1558, when King   established a permanent postal route from   to  .  The service was dissolved during the foreign partitions in the 18th century. After regaining independence in 1918, Poland's postal system developed rapidly as new services were introduced including  , payment of pensions, delivery of magazines, and  .  The government-owned enterprise of Polish Post, Telegraph and Telephone ( ) was established in 1928.\n During  , communication was provided mainly through the military authorities. Many important events in the history of Poland involved the postal service, like the   in 1939, and the participation of the Polish Scouts' Postal Service in the  .\n At present, the service is a modern state-owned company that provides a number of standard and express delivery as well as home-delivery services. With an estimated number of around 83,000 employees (2013),    also has a personal tracking system for parcels. In 2017 the company adopted a strategy that assumes increasing revenues to 6.9 billion   by 2021; the aim is to double revenues from courier and parcel services and a five-fold growth in logistics services. \n Poland, with its 38,544,513 inhabitants, has the   and the sixth-largest in the  . It has a population density of 122 inhabitants per square kilometer (328 per square mile).\n In recent years, Poland's population has decreased due to an increase in emigration and a decline in the birth rate. Since  , a significant number of Poles  , primarily to the  ,   and   in search of better work opportunities abroad.  With better economic conditions and Polish salaries at 70% of the EU average in 2016, this trend started to decrease in the 2010s and workforce became needed in the country.\n As a result, the Polish Minister of Development   suggested that Poles abroad should return to Poland.  Polish minorities are still present in the neighboring countries of Ukraine, Belarus, and Lithuania, as well as in other countries (see   for population numbers). Altogether, the number of ethnic Poles living abroad is estimated to be around 20 million.  The largest number of   can be found in the  ,  ,   and  .  The   (TFR) in Poland was estimated in 2016 at 1.39 children born to a woman.  Poland has an average age of 41.1 years. \n  ( ) belongs to the   subgroup of  , with close relations to   and  .  It is the   and predominant spoken language in Poland, but it is also used throughout the world by   in other countries as well as being one of the official  . Its written standard is the  , which has 9 additions to the letters of the   ( ,  ,  ,  ,  ,  ,  ,  ,  ), with the notable exclusion of  , , and  , which are used mainly for foreign or borrowed words. The deaf communities use   belonging to the  .\n According to the  ,  16 other languages have officially recognized status of minority languages: 1 regional language (  – spoken by around 366,000 people,  but only 108,000 declared its everyday use in the census of 2011 ), 10 languages of 9 national minorities (minority groups that have their own independent state elsewhere) and 5 languages of 4 ethnic minorities (spoken by the members of minorities not having a separate state elsewhere). Jewish and Romani minorities each have 2 minority languages recognized.\n Languages having the status of national minority's language are Armenian, Belarusian, Czech, German, Yiddish, Hebrew, Lithuanian, Russian, Slovak and Ukrainian. Languages having the status of ethnic minority's language are  ,   (called   in Poland) and  . Also, official recognition is granted to two  :   and  . \n Official recognition of a language provides certain rights (under conditions prescribed by the law): of education in that language, of having the language established as the secondary administrative language or help language in bilingual   and of financial support from the state for the promotion of that language.\n More than 50% of Polish citizens declare knowledge of the  , followed by   (38%) and   (34%). \n The Poles are a   ethnic group and a   native to Poland, who are native speakers of the Polish language along with  , and share cultural or linguistic similarities with   and  . The formation of the Polish identity and ethnicity can be traced to the 10th century when Duke   politically unified the Western Slavic tribes of  ,  ,  ,  ,  ,   and others,  which inhabited the area of central Europe between the   River in the west and the   in the east, and between the   and   mountains in the south and the Baltic sea in the north, and then by   as the official state religion. \n Following the formation of the   in 1569, the country over the next two centuries contained  .  The Commonwealth was primarily composed of three nations:  ,  , and   (Ukrainians and Belarusians) — there were also sizable minorities of groups such as Germans, Jews, Latvians,  ,  ,   and  .  After the partitions of Poland at the end of the 18th century, the bulk of the ethnic Polish population was primarily located in  , and in the   and   provinces. When Poland regained its independence in 1918, Poles constituted the majority of the population in the country, during the  , with sizable Ukrainian, Belarusian, Jewish and German minorities. \n Today, Poland is primarily inhabited by ethnic Poles. In the  , 37,310,341 (96.88%) reported   as their first identity, 435,750 (1.13%)  , 17,746 (0.04%)  , 74,464 (0.19%)  , 38,387 (0.09%)  , and 36,399 (0.09%)  .   were reported by 88,577 people (0.23%) and 521,470 people (1.35%) did not report any identity.  Other minority national and ethnic groups in Poland include the  ,  ,  ,  ,  ,  ,  ,  ,  ,   and  . Ethnic Poles themselves can be divided into many diverse     sub-groups, such as  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,   and   among many others.\n The statistics on   do not include recently arrived migrant workers.  More than 1.7 million Ukrainian citizens worked legally in Poland in 2017. \n For centuries the Slavic people inhabiting the lands of modern-day Poland have practiced various forms of   known as   (“native faith”).  In the year 966, Duke   converted to  , and submitted to the authority of the  .  This event came to be known as the  .  However, this did not put an end to pagan beliefs in the country. The persistence was demonstrated by a series of rebellions known as the   in the first half of the 11th century, which also showed elements of a peasant uprising against landowners and feudalism,  and led to a mutiny that destabilized the country. \n Since then, Poland has been a predominantly Catholic nation, however throughout its history, religious tolerance was an important part of the political culture. In 1264, the  , also known as a Charter of Jewish Liberties, granted   living in the Polish lands unprecedented legal rights not found anywhere in Europe. In 1424, the Polish king was pressed by the Bishops to issue the  , outlawing early Protestant  . Then in 1573, the   marked the formal beginning of extensive religious freedoms granted to all faiths in the Polish-Lithuanian Commonwealth. The act was not imposed by a king or consequence of war, but rather resulted from the actions of members of the Polish-Lithuanian society. It was also influenced by the events of the 1572 French  , which prompted the Polish-Lithuanian nobility to see that no monarch would ever be able to carry out such reprehensible atrocities in Poland. The act is also credited with keeping the Polish-Lithuanian Commonwealth out of the  , fought between German Protestants and Catholics. \n Religious tolerance in Poland spurred many theological movements such as Calvinist   and a number of other Protestant groups, as well as atheists, such as ex-Jesuit philosopher  , one of the first atheist thinkers in Europe. Also, in the 16th century,   from the Netherlands and Germany settled in Poland—after being persecuted in Western Europe—and became known as the  .\n In 2014, an estimated 87% of the population belonged to the Catholic Church. Though rates of religious observance are lower at 52%,  Poland remains one of the most religious countries in Europe.  Contemporary religious minorities include   (about 506,800),  various Protestants (about 150,000) — including 77,500   in the  ,  23,000   in the  , 10,000   in the   and other smaller   denominations  —   (126,827),   ,  ,  , and  , including the   of   region. There are also several thousand neopagans, some of whom are members of the  .\n From 16 October 1978 until his death on 2 April 2005,   reigned as   of the Roman Catholic Church. He is the only Polish Pope to date.  Additionally he is credited with having played a significant role in hastening the downfall of communism in Poland and throughout  . \n Freedom of religion is now guaranteed by the 1989 statute of the Polish Constitution,  enabling the emergence of additional denominations.  The   between the   and Poland guarantees the teaching of religion in state  schools. According to a 2007 survey, 72% of respondents were not opposed to   in public schools; alternative courses in ethics are available only in one percent of the entire public educational system. \n Famous sites of Roman Catholic pilgrimage in Poland include the   in the southern Polish city of  ,  ,  . Many tourists also visit the   in   just outside  .   is the   statue of Jesus in the world.  Orthodox pilgrims visit Mountain Grabarka near  . \n Poland's healthcare system is based on an all-inclusive insurance system. State subsidised healthcare is available to all Polish citizens who are covered by this general health insurance program. However, it is not compulsory to be treated in a state-run hospital as a number of private medical complexes exist nationwide. \n All medical service providers and hospitals in Poland are subordinate to the  , which provides oversight and scrutiny of general medical practice as well as being responsible for the day-to-day administration of the healthcare system. In addition to these roles, the ministry is tasked with the maintenance of standards of hygiene and patient-care.\n Hospitals in Poland are organised according to the regional administrative structure, resultantly most towns have their own hospital  .  Larger and more specialised medical complexes tend only to be found in larger cities, with some even more specialised units located only in the capital, Warsaw. However, all   have their own general hospital (most have more than one), all of which are obliged to have a trauma centre; these types of hospital, which are able to deal with almost all medical problems are called 'regional hospitals'  . The last category of hospital in Poland is that of specialised medical centres, an example of which would be the  , Poland's leading, and most highly specialised centre for the research and treatment of cancer.\n In 2012, the Polish health-care industry experienced further transformation. Hospitals were given priority for refurbishment where necessary.  As a result of this process, many hospitals were updated with the latest medical equipment.\n In 2016, the average life expectancy at birth was 77.6 years (73.7 years for infant male and 81.7 years for infant female). \n The   ( ) established in 1773, was the world's first state ministry of education.  The education of Polish society was a goal of the nation's rulers as early as the 12th century. The library catalogue of the   of Kraków dating back to 1110 shows that in the early 12th century Polish academia had access to European and Classical literature. The   was founded in 1364 by   in Kraków—the school is  .\n As of 2012 ,  , coordinated by the  , ranks Poland's educational system higher than the OECD average. \n Education in Poland starts at the age of five or six (with the particular age chosen by the parents) for the '0' class (Kindergarten) and six or seven years in the 1st class of primary school (Polish  ). It is compulsory that children participate in one year of formal education before entering the 1st class at no later than 7 years of age. Corporal punishment of children in schools is officially prohibited since 1783 (before the partitions) and criminalised since 2010 (in schools as well as at home).\n At the end of the 6th class when students are 13, students take a compulsory exam that will determine their acceptance and transition into a specific lower secondary school ( —middle school or junior high). They will attend this school for three years during classes 7, 8, and 9. Students then take another compulsory exam to determine the upper secondary level school they will attend. There are several alternatives, the most common being the three years in a   or four years in a  . Both end with a maturity examination ( —similar to French  ), and may be followed by several forms of higher education, leading to   or inżynier (the Polish   first cycle qualification),   (second cycle qualification) and eventually doktor (third cycle qualification). \n In Poland, there are 500 university-level institutions for the pursuit of higher education.  There are 18 fully accredited traditional universities, 20 technical universities, 9 independent medical universities, 5 universities for the study of economics, 9 agricultural academies, 3 pedagogical universities, a theological academy, 3 maritime service universities and 4 national military academies.  Also, there are a number of higher educational institutions dedicated to the teaching of the arts—amongst these are the 7 academies of music. \n The culture of Poland is closely connected with its intricate 1,000-year  .  With origins in the culture of the  , over time Polish culture has been influenced by its interweaving ties with the  ,   and   worlds as well as in continual dialog with the many other ethnic groups and minorities living in Poland.  The people of Poland have traditionally been seen as hospitable to artists from abroad and eager to follow cultural and artistic trends popular in other countries. In the 19th and 20th centuries the Polish focus on cultural advancement often took precedence over political and economic activity. These factors have contributed to the versatile nature of Polish art. \n Artists from Poland, including famous musicians such as  ,  ,   and  , and traditional, regionalized   create a lively and diverse music scene, which even recognizes its own music genres, such as   and  .\n The origins of Polish music can be traced to the 13th century; manuscripts have been found in   containing   compositions related to the Parisian  . Other early compositions, such as the melody of   and   (a coronation   for Polish kings by an unknown composer), may also date back to this period, however, the first known notable composer,  , lived in the 15th century. During the 16th century, two main musical groups – both based in   and belonging to the King and Archbishop of   – led to the rapid development of Polish renaissance music.  , a native-born Italian who lived in Kraków from about the age of five, became a renowned lutenist at the court of Sigismund III, and not only imported some of the musical styles from southern Europe, but blended them with native folk music. \n In the 17th and 18th centuries, Polish baroque composers mostly wrote either   or secular compositions such as   and   for voices or instruments. At the end of the 18th century, Polish classical music evolved into national forms like the  . Also,  's  , which premiered in 1794, is regarded as the first Polish national  .\n Traditional Polish folk music has had a major effect on the works of many well-known Polish composers, and no more so than on Fryderyk Chopin, a widely recognised national hero of the arts. All of Chopin's   involve the piano and are technically demanding, emphasising nuance and expressive depth. As a great composer, Chopin invented the   known as the   and made major innovations to the  ,  ,  ,  ,  ,  ,   and  , he was also the composer of a number of polonaises which borrowed heavily from traditional Polish folk music. It is largely thanks to him that such pieces gained great popularity throughout Europe during the 19th century. Nowadays the most distinctive folk music can be heard in the towns and villages of the mountainous south, particularly in the region surrounding the winter resort town of  .\n Today Poland has an active music scene, with the jazz and metal genres being particularly popular among the contemporary populace. Polish jazz musicians such as   created a unique style, which was most famous in the 1960s and 1970s and continues to be popular to this day. Since the fall of communism throughout Europe, Poland has become a major venue for large-scale music festivals, chief among which are the  ,   and  .\n Art in Poland has always reflected European trends while maintaining its unique character. The  , later developed by  , produced monumental portrayals of customs and significant events in Polish history.  Other institutions such as the   were more innovative and focused on both historical and contemporary styles.  In recent years, art academies such as the  ,  ,   and   gained much recognition.\n Perhaps the most prominent and internationally admired Polish artist was  , who specialized in the style of  .  Lempicka was described as \"the first woman artist to become a glamour star.\"  Another notable was  , born Zielenkiewicz, who represented   and   in France and England. \n Prior to the 19th century only   and Italian-born   had the privilege of being recognized abroad. The   movement witnessed the birth of modern Polish art, and engaged in a great deal of formal experimentation led by  ,  ,  , and a group of Polish  .    was an ardent supporter of  , its main representative being  , while   specialized in  . Within historically-orientated circles,   dominated with his monumental   and   theme. \n Since the inter-war years, Polish art and documentary photography has enjoyed worldwide fame and in the 1960s the   was formed.  Throughout the entire country, many national museum and art institutions hold valuable works by famous masters. Major museums in Poland include the  ,  ,  ,  , and  , as well as the  , and the  . Important collections are also held at the  ,   and in the  . The most distinguished painting of Poland is   by Leonardo da Vinci, held at the   in  . Although not Polish, the work had a strong influence on Polish culture and has been often associated with Polish identity. \n Polish cities and towns reflect a whole spectrum of European architectural styles.   is represented by  , and  , is characteristic for the   style found in Poland. Richly decorated   and     are the common elements of the Polish Renaissance architecture,  as evident in the   in Poznań. For some time the late renaissance style known as  , most notably in the   in  , coexisted with the early baroque style, typified in the  .\n History has not been kind to Poland's architectural monuments. Nonetheless, a number of ancient structures has survived: castles, churches, and stately homes, often unique in the regional or European context. Some of them have been painstakingly restored, like  , or completely reconstructed, including the   and   of Warsaw and the Old Town of  .\n The architecture of Gdańsk is mostly of the Hanseatic variety, a Gothic style common among the former trading cities along the Baltic sea and in the northern part of Central Europe. The architectural style of   is mainly representative of German architecture, since it was for centuries located within the Holy Roman Empire. The centres of   and   on the   are good examples of well-preserved medieval towns. Poland's ancient capital,  , ranks among the best-preserved   and Renaissance urban complexes in Europe.\n The second half of the 17th century is marked by   architecture. Side towers, such as those of   in Białystok, are typical for the Polish baroque. The classical   is represented by the University in Wrocław. The profuse decorations of the   in Warsaw are characteristic of the   style. The centre of Polish classicism was Warsaw under the rule of the last Polish king  . \nThe   is the most notable example of Polish  .   represents the   style in architecture, while the   in   is an example of  .\n Traditional folk architecture in the villages and small towns scattered across the vast Polish countryside is characterized by its extensive use of wood as the primary building material. Some of the best preserved and oldest structures include wooden  ,\nand   primarily located across southern Poland in the   and   regions of the Carpathian mountains.  Numerous examples of secular structures such as   ( ),   ( ),  ,  ,   and country inns ( ) can still be found across most regions of Poland.\n These structures were mostly built using the  , common to eastern and northern Europe since the   and also going further back to the old Slavic building traditions, exemplified by the wooden   (a type of fortified settlement built between the 6th and 12th centuries). These traditional construction methods were utilized all the way up to the start of the 20th century, and gradually faded in the first decades when Poland's population experienced a demographic shift to urban dwelling away form the countryside.\n The earliest   dates back to the 12th century,  when Poland's official language was  . Within Polish literary customs, it is appropriate to highlight the published works concerning Poland not written by ethnic Poles. The most vivid example is  , a foreign   and the first chronicler who  . \n The first documented phrase in the   reads \" \" (\"Let me grind, and you take a rest\"), reflecting the culture of early Poland.  It was composed by an abbot named Piotr (Peter) within the Latin language chronicle   from between 1269 and 1273, which described the history of the   monastery in  ,  . The sentence was allegedly uttered almost a hundred years earlier by a   settler, who expressed pity for his spouse's duty of grinding by the  . The sentence has been included in the  . \n Most   records in Latin and the   contain the oldest extant manuscript of fine Polish   entitled the  , as well as the earliest Polish-language bible, the so-called  .  One of the first printing houses was established by   in the 1470s, while   was considered the pioneer of commercial print in Poland. Haller's  , an astronomical wall calendar from 1474, is Poland's oldest surviving print. \n The tradition of extending Polish historiography in Latin was subsequently inherited by  , Bishop of   in the 13th century, and   in the 15th century.  This practice, however, was abandoned by  , who became one of the first   authors to write most of his works in Polish, along with  .  Poland also hosted many famed poets and writers from abroad like  ,   and  . A Polish writer who utilized Latin as his principal tool of expression was  , one of the most renowned Latin poets of his time, who was laureled by the  . Other writers of the Polish Renaissance include  ,  ,   and  . Throughout this period Poland also experienced the early stages of  . The main figure of Polish Reformation was  , who, with the permission of King  , created the European Protestant Congregation of London in 1550. \n During the   era, the   greatly influenced Polish literature and literary techniques, often relying on God and religious matters.  The leading baroque poet was  , who incorporated   into his publications.  , also a respected baroque writer, is mostly remembered for his tales and memoirs reflecting   culture in the  .  Subsequently, the   was dominated by  ,  ,  ,   and two Polish monarchs,   and  . In 1776,   composed the first proper   entitled  , which was a milestone for Polish literature. \n Among the best known   are the \" \"–the three   active in the  – ,   and  .  Adam Mickiewicz is widely regarded as one of the greatest Polish,   and   poets.  He is known primarily for the    , a masterpiece of Polish literature.\n A Polish prose poet of the highest order,  , the son of dramatist  , won worldwide fame with his English-language novels and stories that are informed with elements of the  .  Conrad's books and published novels like  ,   and   are believed to be one of the finest works ever written, placing Conrad among the greatest novelists of all time. \n In the 20th century, five Polish   and poets were awarded the  –  for  ,   for  ,  ,   and  .  In 2019, Polish author   was awarded the Nobel Prize in Literature for the year 2018. \n The history of Polish cinema is as long as history of   itself. Over decades, Poland has produced outstanding directors, film producers, cartoonists and actors that achieved world fame, especially in  . Moreover, Polish inventors played an important role in the development of world cinematography and modern-day television. Among the most famous directors and producers, who worked in Poland as well as abroad are  ,  ,  , the   ( ,  ,   , and  ),  ,  ,   and  .\n In the 19th century, throughout partitioned Poland, numerous amateur inventors, such as  , were eager to construct a film projector. In 1894, Prószyński was successful in creating a  , one of the first cameras in the world. The invention, which took photographs and projected pictures, was built before the   lodged their patent.  He also patented an  , the first successful hand-held operated film camera. In 1897,  , obtained a British patent for his  . This prototype of television could easily transmit image and sound, thus allowing a live remote view. Following the invention of appropriate apparatus and technological development in the upcoming years, his then-impossible concept became reality. \n Polish cinema developed rapidly in the  . The most renowned star of the   era was Polish actress  . During this time, the   also evolved in Poland. Films in the   with Jewish themes, such as   (1937), played an important part in pre-war Polish cinematography. In 1945 the government established ' ', a state-run film production and distribution organization, with director   as the head of the company. Ford's   (1960) was viewed by millions of people in the Soviet Union, Czechoslovakia and France.  This success was followed by the popular historical films of   and Andrzej Wajda. Wajda's 1975 film   was nominated at the  . \n In 2015,   by   won the  .  In 2019, Pawlikowski received an   nomination for his historical period drama  . Other well-known Polish Oscar-winning productions include   (2002) by Roman Polański.\n Poland has a number of major media outlets, chief among which are the national television channels.   is Poland's   corporation; about a third of its income comes from a  , while the rest is made through revenue from   and  . State television operates two mainstream channels, TVP 1 and TVP 2, as well as regional programs for each of the country's 16   (as  ). In addition to these general channels, TVP runs a number of genre-specific programmes such as  ,  ,  ,  ,   and  , the latter is a state-run channel dedicated to the transmission of Polish language television for the   abroad.\n Poland has several 24-hour news channels:  , Polsat News 2,  ,   TVN 24 Biznes i Świat, TV Republika and WPolsce.pl.\n In Poland, there are also daily newspapers like   (\"Electoral Gazette\"),   (\"The Republic\") and   (\"Polish Daily Newspaper\") which provide traditional opinion and news, and   such as   and  .  , founded in 1920 is one of the oldest newspapers still in operation in the country. Weeklies include  ,  ,  ,  ,  ,   and  .\n Poland has also emerged as a major hub for video game developers in Europe, with the country now being home to hundreds of studios. Among the most successful ones are  ,  ,   and  .  One of the most popular video game series developed in Poland includes  .  Other notable games include  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,  ,   and  .    hosts  , one of the biggest   events in the world. \n Polish cuisine has evolved over the centuries to become highly eclectic due to Poland's history. Polish cuisine shares many similarities with other   cuisines, especially   and   as well as  ,   ,   and   culinary traditions.  Polish-styled cooking in other cultures is often referred to as  . \n Polish dishes are usually rich in meat, especially pork, chicken and beef (depending on the region), winter vegetables (sauerkraut cabbage in  ), and spices.  It is also characteristic in its use of various kinds of  , the most notable of which are  , as well as   such as   (from the Polish word  )  and a variety of breads like the world-renowned  . Polish cuisine is hearty and uses a lot of cream and eggs. Festive meals such as the meatless Christmas Eve dinner ( ) or   breakfast could take days to prepare in their entirety. \n The main course usually includes a serving of meat, such as roast, chicken, or   (breaded pork cutlet), vegetables, side dishes and salads, including     – shredded root vegetables with lemon and sugar (carrot, celeriac,   beetroot) or sauerkraut ( :  ,  ). The side dishes are usually potatoes, rice or   (cereals). Meals conclude with a dessert such as   (cheesecake),   (  pastry), or   ( ), and tea.\n The Polish national dishes are    ;    ;  ;      ;      ;      ;   roast  ; sour   ( ,  ); mushroom soup, ( ,   quite different from the North American  );      ;      variety of meat broth;     sour rye soup;      ;     and     among others. \n Traditional alcoholic beverages include honey  , widespread since the 13th century,  , wine and   (old Polish names include   and  ).  The world's first written mention of vodka originates from Poland.  The most popular alcoholic drinks at present are beer and wine which took over from vodka more popular in the years 1980–1998.  Tea remains common in Polish society since the 19th century, whilst coffee is drunk widely since the 18th century.  Other frequently consumed beverages include various mineral waters and juices, soft drinks popularized by the fast-food chains since the late 20th century, as well as  ,   and  . \n  and   are among the country's most popular sports, with a rich history of international competitions.   , basketball,  , boxing,  ,  ,  ,  ,  , tennis, fencing, swimming and   are other popular sports.\n The golden era of   occurred throughout the 1970s and went on until the early 1980s when the   achieved their best results in any FIFA World Cup competitions finishing 3rd place in   and   tournaments. The team won a gold medal   at the   and two silver medals,   and  . Poland, along with Ukraine, hosted the  . \n As of 2019, the   is ranked   in the world.  Volleyball team won a gold medal in   and three gold medals in    ,   and  . \n  is a highly successful strongman competitor and has won more   titles than any other competitor in the world, winning the event in 2008 for the fifth time. The first Polish   driver,  , has brought awareness of Formula One racing to Poland. He won the  , took part in   and had a full-time seat for the 2019 F1 season.\n Poland has made a distinctive mark   thanks to  , a highly successful Polish rider. The top   division has one of   for any sport in Poland. The  , one of the major teams in international speedway,  has won the   championships three times consecutively, in 2009, 2010, and 2011. No team has ever managed such feat. \n Poles made significant achievements in mountaineering, in particular, in the   and the winter ascending of the  . Polish mountains are one of the tourist attractions of the country. Hiking, climbing, skiing and mountain biking and attract numerous tourists every year from all over the world.  Water sports are the most popular summer recreation activities, with ample locations for fishing, canoeing, kayaking, sailing and windsurfing especially in the northern regions of the country. \n Fashion was always an important aspect of Poland and its  . Although the Polish fashion industry is not as famed in comparison to the industries of France and Italy, it still contributed to global trends and clothing habits. Moreover, several Polish designers and stylists left a lifelong legacy of beauty inventions and  , which are still in use nowadays.\n Throughout history, the clothing styles in Poland often varied due to foreign influence, especially from the neighbouring countries and the Middle East. Poles absorbed some habits, which were present in the Middle East at the time. The high-class   and   wore attire that somewhat resembled oriental styles.  The outfits included a  ,  ,  , and a type of   called  , brought by   merchants. Wealthy Polish aristocrats also kept captive   and   in their courts; this affected the national dress.  The extensive multiculuralism present in the   developed the ideology of \" \".\n The Polish national dress as well as the fashion and etiquette of Poland also reached the royal court at   in the 18th century. Some French dresses inspired by Polish outfits were called  , meaning \"Polish-styled\". The most famous example is the   or simply  , a woman's garment with draped and swagged  , worn over an underskirt or  .  Another notable example is the  , a long mantle with collar and hood, which was possibly introduced by  's Polish mistress  . \n Established in 1999, the retail store   is Poland's most successful clothing store chain, operating over 1,700 retail shops in 19 countries. \n In the early 20th century, the underdeveloped fashion and cosmetics industry in   was heavily dominated by western styles, mostly from the United Kingdom and the United States. This inspired Polish beautician   to seek employment abroad and create a line of cosmetics company called   in  . In 1920, Faktorowicz invented the conjoined word \"make-up\" based on the verb phrase \"to make up\" one's face, which is now used as an alternative for \"cosmetics\".  Faktorowicz also raised to fame by inventing modern   and providing services to   artists of the era. \n Another Pole that contributed to the development of cosmetics was  , the founder of  , which made her one of the richest women in the world,  and was bought by  .  One of Rubinstein's most controversial quotes was \"There are no ugly women, only lazy ones\". \n  founded in 1983, is Poland's largest beauty products manufacturer and retailer, sold in 700 locations worldwide, including retail salons in  ,  ,  ,   and  .  Internationally successful models from Poland include  ,  ,  ,  ,  , and  ."},
{"Title": "China - Wikipedia", "Heading1": "China", "Heading2": "Contents", "URLText": "( :  ;  :  ; literally: 'Central State' or 'Middle Kingdom'), officially the   ( ), is a country in   and is the  , with a population of around   in 2017. Covering approximately 9,600,000 square kilometers (3,700,000 sq mi), it is the   country by area.  Governed by the  , the state exercises jurisdiction over 22  ,  five  , four   ( ,  ,  , and  ), and the   of   and  .\n China emerged as one of the world's  , in the fertile basin of the   in the  . For millennia, China's political system was based on hereditary monarchies, or  , beginning with the semi-mythical   in 21st century  . Since then, China has   numerous times. In the 3rd century BCE,   and established  . The succeeding  , which ruled from 206 BCE until 220 CE, saw some of the   at that time, including   and the  , along with agricultural and medical improvements. The invention of   and   in the   (618–907) and   (960–1127) completed the  . Tang culture spread widely in Asia, as the new   brought traders to as far as   and the  . Dynastic rule ended in 1912 with the  , when the   replaced the  . China, as a whole, was ravaged by   and   during  . The subsequent   resulted in a division of territory in 1949 when the   led by     the People's Republic of China on   while the  -led nationalist government retreated to the island of   where it governed until 1996 when Taiwan transitioned to democracy. The   remains disputed to this day.\n China is a       and is one of the few existing  .   and   groups have denounced and criticized the   for  ,  ,   and  , and cracking down on protests  . The Chinese government says that the right to subsistence and   is a prerequisite to other types of human rights and that the notion of human rights should take into account a country's present economic level.\n Since the introduction of  ,   has been one of the world's   with annual growth rates consistently above 6 percent. According to the World Bank, China's GDP grew from $150 billion in 1978 to $12.24 trillion by 2017. According to official data, China's GDP in 2018 was 90 trillion Yuan ($13.5 trillion). Since 2010, China has been the world's second-largest economy by  , and since 2014, the largest economy in the world by  . China is also the world's   and   of goods. China is a recognized   and has the world's  , the  , and the  . The PRC is a   of the   as it replaced the ROC in 1971, as well as an active global partner of  . China is also a leading member of numerous formal and informal multilateral organizations, including the  ,  ,  ,  , the  , and the  . China is one of the world's most technologically advanced nations and is home to some of the world's largest tech giants such as  ,  ,  , and  . Since 2019, China has the highest number of rich people in the world.  China has been characterized as a  , mainly because of its massive population, economy, and military.\n The word \"China\" has been used in English since the 16th century. It is not a word used by the Chinese themselves. It has been traced through  ,  , and   back to the Sanskrit word  , used in  . \n \"China\" appears in  's 1555 translation  of the 1516 journal of the      .  Barbosa's usage was derived from     ( ), which was in turn derived from     ( ).    was first used in early   scripture, including the   (5th century  ) and the   (2nd century  ).  In 1655,   suggested that the word China is derived ultimately from the name of the   (221–206 BCE), which existed as a   since the 9th century BC at the furthest west of ancient China.  Although this derivation is still given in various sources,  the origin of the Sanskrit word is still a matter of debate, according to the  .  Other suggestions include the names for   and the state of   ( , another name for  ). \n The official name of the modern state is the \"People's Republic of China\" ( :  ;  :  ). The shorter form is \"China\"     from   (\"central\") and   (\"state\"),  a term which developed under the   dynasty in reference to its  .  It was then applied to the area around   (present-day Luoyang) during the   and then to China's   before being used as an occasional synonym for the state under the  .  It was often used as a cultural concept to distinguish the   people from  .  The name   is also translated as   in English. \n Archaeological evidence suggests that early   inhabited China between 2.24 million and 250,000 years ago.  The hominid fossils of  , a   who  ,  were discovered in a cave at   near  ; they have been dated to between 680,000 and 780,000  .  The fossilized teeth of   (dated to 125,000–80,000  ) have been discovered in   in  ,  .  Chinese   existed in   around 7000  ,    around 6000  ,    from 5800–5400  , and   dating from the 5th millennium  . Some scholars have suggested that the   (7th millennium  ) constituted the earliest Chinese writing system. \n According to Chinese tradition, the   was the  , which emerged around 2100  .  Xia dynasty marked the beginning of China's political system based on hereditary monarchies, or  , which lasted for a millennia.  The dynasty was considered   by historians until scientific excavations found early   sites at  , Henan in 1959.  It remains unclear whether these sites are the remains of the Xia dynasty or of another culture from the same period.  The succeeding   is the earliest to be confirmed by contemporary records.  The Shang ruled the plain of the   in eastern China from the 17th to the 11th century  .  Their   (from    )  represents the oldest form of Chinese writing yet found,  and is a direct ancestor of modern  . \n The Shang was conquered by the  , who ruled between the 11th and 5th centuries  , though centralized authority was slowly eroded by feudal warlords. Some principalities eventually emerged from the weakened Zhou, no longer fully obeyed the Zhou king and continually waged war with each other in the 300-year  . By the time of the   of the 5th–3rd centuries  , there were only seven powerful states left.\n The   ended in 221   after the   conquered the other six kingdoms, reunited China and established the dominant order of  .   proclaimed himself the   of the  . He enacted Qin's   reforms throughout China, notably the forced standardization of  ,  , road widths (i.e., cart axles' length), and  . His dynasty also   in  ,  , and  .  The Qin dynasty lasted only fifteen years, falling soon after the First Emperor's death, as his harsh authoritarian policies led to widespread rebellion. \n Following a   during which the imperial library at    ,  the   emerged to rule China between 206   and   220, creating a cultural identity among its populace still remembered in the ethnonym of the  .  The Han  , with military campaigns reaching  ,  , and  , and the   from  . Han involvement in Central Asia and   helped establish the land route of the  , replacing the earlier path over the   to India. Han China gradually became the largest economy of the ancient world.  Despite the Han's initial decentralization and the official abandonment of the Qin philosophy of   in favor of  , Qin's legalist institutions and policies continued to be employed by the Han government and its successors. \n After the  , a period of strife known as   followed,  whose central figures were later immortalized in   of the   of  . At its end,   was swiftly overthrown by the  . The Jin fell to   upon the ascension of a  ; the   then   and ruled northern China as the  . The   unified them as the  , whose   reversed his predecessors' apartheid policies and  , largely integrating them into Chinese culture. In the south, the general   secured the abdication of the Jin in favor of the  . The various successors of these states became known as the  , with the two areas finally reunited by the   in 581. The Sui restored the Han to power through China, reformed its agriculture, economy and   system, constructed the  , and patronized  . However, they fell quickly when their conscription for public works and a   in   provoked widespread unrest. \n Under the succeeding   and   dynasties, Chinese economy, technology, and culture entered a golden age.  The Tang Empire returned control of the   and the Silk Road,  brought traders to as far as   and the  ,  and made the capital   a cosmopolitan urban center. However, it was devastated and weakened by the   in the 8th century.  In 907, the Tang disintegrated completely when the local military governors became ungovernable. The Song dynasty ended the   in 960, leading to a balance of power between the Song and  . The Song was the first government in world history to issue paper money and the first Chinese   to establish a permanent standing navy which was supported by the developed shipbuilding industry along with the sea trade. \n Between the 10th and 11th centuries, the population of China doubled in size to around 100 million people, mostly because of the expansion of rice cultivation in central and southern China, and the production of abundant food surpluses. The Song dynasty also saw a  , in response to the growth of Buddhism during the Tang,  and a flourishing of philosophy and the arts, as   and   were brought to new levels of maturity and complexity.  However, the military weakness of the Song army was observed by the    . In 1127,   and the capital   were captured during the  . The remnants of the Song retreated to  . \n The 13th century brought the  . In 1271, the   leader   established the  ; the Yuan conquered the last remnant of the Song dynasty in 1279. Before the Mongol invasion, the population of Song China was 120 million citizens; this was reduced to 60 million by the time of the census in 1300.  A peasant named Zhu Yuanzhang overthrew the Yuan in 1368 and founded the   as the  . Under the Ming dynasty, China enjoyed another golden age, developing one of the strongest navies in the world and a rich and prosperous economy amid a flourishing of art and culture. It was during this period that admiral   led the   throughout the  , reaching as far as  . \n In the early years of the Ming dynasty, China's capital was moved from   to Beijing. With the budding of capitalism, philosophers such as   further critiqued and expanded Neo-Confucianism with concepts of   and equality of  .  The   stratum became a supporting force of industry and commerce in the tax boycott movements, which, together with the famines and defense against   and   led to an exhausted treasury. \n In 1644, Beijing was captured by a coalition of peasant rebel forces led by  . The   committed suicide when the city fell. The Manchu  , then allied with Ming dynasty general  , overthrew Li's short-lived   and subsequently seized control of Beijing, which became the new capital of the Qing dynasty.\n The  , which lasted from 1644 until 1912, was the last imperial dynasty of China. Its   (1618–1683) cost 25 million lives and the  .  After the   ended, the further conquest of the   added Mongolia, Tibet and Xinjiang to the empire.  The centralized autocracy was strengthened to crack down on   with the policy of valuing agriculture and restraining commerce, the   (\"sea ban\"), and ideological control as represented by the  , causing social and technological stagnation.  In the mid-19th century, the dynasty experienced Western imperialism in the   with Britain and France. China was forced to pay compensation, open treaty ports, allow   for foreign nationals, and cede   to the British  under the 1842  , the first of the  . The   (1894–95) resulted in Qing China's loss of influence in the  , as well as the cession of Taiwan to  . \n The Qing dynasty also began experiencing   in which tens of millions of people died, especially in the  , the failed   that ravaged southern China in the 1850s and 1860s and the   (1862–77) in the northwest. The initial success of the   of the 1860s was frustrated by a series of military defeats in the 1880s and 1890s.\n In the 19th century, the great   began. Losses due to emigration were added to by conflicts and catastrophes such as the  , in which between 9 and 13 million people died.  The   drafted a   in 1898 to establish a modern  , but these plans were thwarted by the  . The ill-fated anti-foreign   of 1899–1901 further weakened the dynasty. Although Cixi sponsored a program of reforms, the   of 1911–12 brought an end to the Qing dynasty and established the  .\n On 1 January 1912, the Republic of China was established, and   of the   (the KMT or Nationalist Party) was proclaimed provisional president.  However, the presidency was later given to  , a former Qing general who in 1915 proclaimed himself  . In the face of popular condemnation and opposition from his own  , he was forced to abdicate and re-establish the republic. \n After Yuan Shikai's death in 1916, China was politically fragmented. Its Beijing-based government was internationally recognized but virtually powerless; regional warlords controlled most of its territory.  In the late 1920s, the Kuomintang, under  , the then Principal of the  , was able to reunify the country under its own control with a series of deft military and political manoeuvrings, known collectively as the  .  The Kuomintang moved the nation's capital to   and implemented \"political tutelage\", an intermediate stage of political development outlined in Sun Yat-sen's   program for transforming China into a modern democratic state.  The   in China made it difficult for Chiang to battle the     (PLA), against whom the Kuomintang had been warring since 1927 in the  . This war continued successfully for the Kuomintang, especially after the PLA retreated in the  , until Japanese aggression and the 1936   forced Chiang to confront  . \n The   (1937–1945), a   of  , forced an uneasy alliance between the Kuomintang and the PLA. Japanese forces committed numerous   against the civilian population; in all, as many as 20 million Chinese civilians died.  An estimated 40,000 to 300,000 Chinese   in the city of Nanjing alone during the Japanese occupation.  During the war, China, along with the UK, the US, and the  , were referred to as \"trusteeship of the powerful\"  and were recognized as the Allied \" \" in the  .  Along with the other three great powers, China was one of the four major  , and was later considered one of the primary victors in the war.  After the   in 1945, Taiwan, including the  , was  . China emerged victorious but war-ravaged and financially drained. The continued distrust between the Kuomintang and the Communists led to the resumption of civil war. Constitutional rule was established in 1947, but because of the ongoing unrest, many provisions of the   were never implemented in mainland China. \n Major combat in the   ended in 1949 with the Communist Party in control of most of  , and the  , reducing its territory to only  ,  , and their surrounding islands. On 21 September 1949,       the establishment of the People's Republic of China with a speech at the First Plenary Session of the Chinese People's Political Consultative Conference.  This was followed by a mass celebration in   on 1 October, at which the proclamation was made publicly by Mao at the Tiananmen Gate, the date becoming the new country's first  .  In 1950, the People's Liberation Army   from the ROC  and  .  However, remaining Kuomintang forces continued to wage   throughout the 1950s. \n The regime consolidated its popularity among the peasants through land reform, which included the  .  China developed an independent industrial system and  .  The Chinese population increased from 550 million in 1950 to 900 million in 1974.  However, the  , an idealistic massive reform project, resulted in   between 1958 and 1961, mostly from starvation.  In 1966, Mao and his allies launched the  , sparking a decade of political recrimination and social upheaval that lasted until Mao's death in 1976. In October 1971, the PRC   in the United Nations, and took its seat as a permanent member of the Security Council. \n After Mao's death, the   was quickly arrested and held responsible for the excesses of the Cultural Revolution.   took power in 1978, and instituted significant  . The Party loosened governmental control over citizens' personal lives, and the   were gradually disbanded in favor of working contracted to households. This marked China's transition from a planned economy to a mixed economy with an  .  China adopted its current   on 4 December 1982. In 1989, the   of   brought sanctions against the Chinese government from various countries. \n ,   and   led the nation in the 1990s. Under their administration, China's economic performance pulled an estimated 150 million peasants out of poverty and sustained an average annual gross domestic product growth rate of 11.2%.  The country joined the   in 2001, and maintained its high rate of economic growth under   and  's leadership in the 2000s. However, the growth also severely impacted the country's resources and environment,  and caused  .  Living standards continued to improve rapidly despite the  , but political control remained tight. \n Preparations for a decadal leadership change in 2012 were marked by  .  During the   in November 2012, Hu Jintao was replaced as   by  .  Under Xi, the Chinese government began large-scale efforts to reform its economy,  which has suffered from structural instabilities and slowing growth.  The   also announced major reforms to the   and prison system. \n China's landscape is vast and diverse, ranging from the   and   in the arid north to the   forests in the wetter south. The  ,  ,   and   mountain ranges separate China from much of   and  . The   and  , the third- and sixth-longest in the world, respectively, run from the   to the densely populated eastern seaboard. China's coastline along the Pacific Ocean is 14,500 kilometers (9,000 mi) long and is bounded by the  ,  ,   and   seas. China connects through the Kazakh border to the   which has been an artery of communication between East and West since the Neolithic through the   – the ancestor of the terrestrial  (s).\n The territory of China lies between     and  , and     and  . China's landscapes vary significantly across its vast territory. In the east, along the shores of the   and the  , there are extensive and densely populated  , while on the edges of the Inner Mongolian plateau in the north, broad   predominate. Southern China is dominated by hills and low mountain ranges, while the central-east hosts the   of China's two major rivers, the   and the  . Other major rivers include the  ,  ,   and  . To the west sit major mountain ranges, most notably the Himalayas. High   feature among the more arid landscapes of the north, such as the   and the  . The world's highest point,   (8,848 m), lies on the Sino-Nepalese border.  The country's lowest point, and the world's third-lowest, is the dried lake bed of   (−154m) in the  . \n China's climate is mainly dominated by   and wet  , which lead to pronounced temperature differences between winter and summer. In the winter, northern winds coming from high-latitude areas are cold and dry; in summer, southern winds from coastal areas at lower latitudes are warm and moist.  The climate in China differs from region to region because of the country's highly complex  .\n A major environmental issue in China is the continued  , particularly the Gobi Desert.  Although barrier tree lines planted since the 1970s have reduced the frequency of  , prolonged drought and poor agricultural practices have resulted in   plaguing northern China each spring, which then spread to other parts of east Asia, including Korea and Japan. China's environmental watchdog,  , stated in 2007 that China is losing 4,000 km  (1,500 sq mi) per year to desertification.  Water quality,  , and   have become important issues in China's relations with other countries. Melting   in the Himalayas could potentially lead to   for hundreds of millions of people. \n \nChina has a very agriculturally suitable climate and has been the largest producer of rice, wheat, tomatoes, brinjal, grapes, water melon, spinach in the world. China is one of 17  ,  lying in two of the world's major  : the   and the  . By one measure, China has over 34,687 species of animals and vascular plants, making it the third-most biodiverse country in the world, after   and  .  The country signed the     on 11 June 1992, and became a party to the convention on 5 January 1993.  It later produced a  , with one revision that was received by the convention on 21 September 2010. \n China is home to at least 551 species of   (the third-highest such number in the world),  1,221 species of birds (eighth),  424 species of reptiles (seventh)  and 333 species of amphibians (seventh).  Wildlife in China share habitat with and bear acute pressure from the world's largest population of  . At least 840   in China, due mainly to human activity such as habitat destruction, pollution and poaching for food, fur and ingredients for  .  Endangered wildlife is protected by law, and as of 2005 , the country has over 2,349  , covering a total area of 149.95 million hectares, 15 percent of China's total land area.  The   was confirmed extinct on 12 December 2006. \n China has over 32,000 species of vascular plants,  and is home to a variety of forest types. Cold   forests predominate in the north of the country, supporting animal species such as   and  , along with over 120 bird species.  The understorey of moist   forests may contain thickets of  . In higher montane stands of   and  , the bamboo is replaced by  .   forests, which are predominate in central and southern China, support as many as 146,000 species of flora.  Tropical and seasonal  , though confined to   and  , contain a quarter of all the animal and plant species found in China.  China has over 10,000 recorded species of  ,  and of them, nearly 6,000 are  . \n In recent decades, China has suffered from  .  While regulations such as the 1979 Environmental Protection Law are fairly stringent, they are poorly enforced, as they are frequently disregarded by local communities and government officials in favor of rapid economic development.  Urban air pollution is a severe health issue in the country; the   estimated in 2013 that 16 of the world's 20 most-polluted cities are located in China.  And China is the country with the highest death toll because of air pollution. There are 1.14 million deaths caused by exposure to ambient air pollution.  China is the  .  The country also has significant   problems: 40% of China's rivers had been polluted by industrial and agricultural waste by late 2011.  In 2014, the internal freshwater resources per capita of China reduced to 2,062m , and it was below 500m  in the  , while 5,920m  in the world. \n In China, heavy metals also cause environmental pollution. Heavy metal pollution is an inorganic chemical hazard, which is mainly caused by lead (Pb), chromium (Cr), arsenic (As), cadmium (Cd), mercury (Hg), zinc (Zn), copper (Cu), cobalt (Co), and nickel (Ni). Five metals among them, Pb, Cr, As, Cd, and Hg, are the key heavy metal pollutants in China. Heavy metal pollutants mainly come from mining, sewage irrigation, the manufacturing of metal-containing products, and other related production activities. High level of heavy metal exposure can also cause permanent intellectual and developmental disabilities, including reading and learning disabilities, behavioral problems, hearing loss, attention problems, and disruption in the development of visual and motor function. According to the data of a national census of pollution, China has more than 1.5 million sites of heavy metals exposure. The total volume of discharged heavy metals in the waste water, waste gas and solid wastes are around 900,000 tons each year from 2005–2011. \n However, China is the world's leading investor in   and  , with  52 billion invested in 2011 alone;  it is a major manufacturer of renewable energy technologies and invests heavily in local-scale renewable energy projects.  By 2015, over 24% of China's energy was derived from renewable sources, while most notably from  : a total installed capacity of 197 GW makes China the   in the world.  China also has the largest power capacity of   and   in the world.  In 2011, the Chinese government announced plans to invest four trillion yuan (US$619 billion) in water infrastructure and   projects over a ten-year period, and to complete construction of a flood prevention and anti-drought system by 2020.  In 2013, China began a five-year, US$277 billion effort to reduce air pollution, particularly in the north of the country. \n The People's Republic of China is the   country in the world by land area  after  , and is the third largest by total area, after Russia and Canada.  China's total area is generally stated as being approximately 9,600,000 km  (3,700,000 sq mi).  Specific area figures range from 9,572,900 km  (3,696,100 sq mi) according to the  ,  to 9,596,961 km  (3,705,407 sq mi) according to the UN Demographic Yearbook,  and the  . \n China has the  , measuring 22,117 km (13,743 mi) from the mouth of the   (Amnok River) to the  .  China  ,   except Russia, which also borders 14.  China extends across much of East Asia, bordering  ,  , and   in Southeast Asia;  ,  ,  ,  , and   in South Asia;  ,   and   in Central Asia; and  ,  , and   in   and  . Additionally, China shares maritime boundaries with  ,  ,  , and the  .\n  states that The People's Republic of China \"is a socialist state under the people's democratic dictatorship led by the working class and based on the alliance of workers and peasants,\" and that the state organs \"apply the principle of democratic centralism.\"  The PRC is one of the world's only    . The Chinese government has been variously described as communist and socialist, but also as authoritarian and  ,  with heavy restrictions in many areas, most notably against  ,  ,  ,  ,   and  .  Its current political, ideological and economic system has been termed by its leaders as the \" \", \" \" (which is   adapted to Chinese circumstances) and the \" \" respectively. \n Since 2018, the main body of the   declares that \"the defining feature of   is the leadership of the   (CPC).\"  The 2018 amendments constitutionalized the     status of China,  wherein the   ( ) holds ultimate power and authority over state and government and serves as the  .  The   is pyramidal. Local People's Congresses are  , and higher levels of People's Congresses up to the   (NPC) are   by the People's Congress of the level immediately below.  The political system is decentralized, and provincial and sub-provincial leaders have a significant amount of autonomy.   , have representatives in the NPC and the   (CPPCC).  China supports the Leninist principle of \" \",  but critics describe the elected National People's Congress as a \" \" body. \n The   is the titular  , elected by the  . The   is the  , presiding over the   composed of four vice premiers and the heads of ministries and commissions. The incumbent president is  , who is also the   and the  , making him China's  . The incumbent premier is  , who is also a senior member of the  , China's   top decision-making body. \n There have been some moves toward political liberalization, in that open contested elections are now held at the village and town levels.  However, the party retains effective control over government appointments: in the absence of meaningful opposition, the CPC wins by default most of the time. Political concerns in China include the growing gap between rich and poor and government corruption.  Nonetheless, the level of public support for the government and its management of the nation is high, with 80–95% of Chinese citizens expressing satisfaction with the central government, according to a 2011 survey. \n The People's Republic of China is divided into 22  , five   (each with a designated minority group), and four  —collectively referred to as \" \"—as well as the   (SARs) of   and  . Geographically, all 31 provincial divisions of mainland China can be grouped into six regions:  ,  ,  ,  ,  , and  .\n China considers   to be  , although Taiwan is governed by the   (ROC), which rejects the PRC's claim.  Conversely, the ROC claims sovereignty over all divisions governed by the PRC.\n The PRC has diplomatic relations with 175 countries and maintains  . Its   is disputed by the Republic of China and a few other countries; it is thus the largest and most populous  . In 1971, the PRC replaced the Republic of China as the sole representative of China in the United Nations and as one of the five permanent members of the  .  China was also a former member and leader of the  , and still considers itself an advocate for  .  Along with Brazil, Russia, India and South Africa, China is a member of the   group of emerging major economies and hosted the group's   at  ,   in April 2011. \n Under its interpretation of the  , Beijing has made it a precondition to establishing diplomatic relations that the other country acknowledges its claim to Taiwan and severs official ties with the government of the Republic of China. Chinese officials have protested on numerous occasions when foreign countries have made diplomatic overtures to Taiwan,  especially in the matter of armament sales. \n Much of current Chinese foreign policy is reportedly based on Premier  's  , and is also driven by the concept of \"harmony without uniformity\", which encourages diplomatic relations between states despite ideological differences.  This policy may have led China to support states that are   or repressive by Western nations, such as  ,   and  .  China has a   with Russia,  and the two states often vote in unison in the UN Security Council. \n China became the world's largest trading nation in 2013, as measured by the sum of imports and exports.  By 2016, China was the largest trading partner of 124 other countries.  In 2017, China exported $2.26 trillion in goods while it imported $1.84 trillion.  In recent decades, China has played an increasing role in calling for   and security pacts amongst its Asia-Pacific neighbours. China became a member of the   (WTO) on 11 December 2001. In 2004, it proposed an entirely new   (EAS) framework as a forum for regional security issues.  The EAS, which includes  , India, Australia and New Zealand, held its inaugural summit in 2005. China is also a founding member of the   (SCO), along with Russia and the Central Asian republics.\n China has had a long and complex trade relationship with the United States. In 2000, the   approved \"permanent normal trade relations\" (PNTR) with China, allowing Chinese exports in at the same low tariffs as goods from most other countries.  China has a significant   with the United States, its most important export market.  In the early 2010s, US politicians argued that the   was significantly undervalued, giving China an unfair trade advantage. \n Since the turn of the century, China has followed a policy of   for trade and bilateral co-operation;  in 2012, Sino-African trade totalled over US$160 billion.  China maintains healthy and highly diversified trade links with the European Union. China has furthermore strengthened its ties with major South American economies, becoming the largest trading partner of Brazil and building strategic links with Argentina. \n China's   has expanded significantly over the last six years and, as of 2019, includes 137 countries and 30 international organizations. \n Ever since its establishment after the second  , the PRC has claimed   governed by the   (ROC), a separate political entity today commonly known as Taiwan, as a part of its territory. It regards the   as its  ,   and   as a part of   and islands the ROC controls in the   as a part of   and  . These claims are controversial because of the complicated  , with the PRC treating the   as one of its most important diplomatic principles. \n In addition to Taiwan, China is also involved in other international territorial disputes. Since the 1990s, China has been involved in negotiations to resolve its disputed land borders, including a   and an undefined border with  . China is additionally involved in multilateral disputes over the ownership of several small islands in the East and South China Seas, such as the   and the  .  On 21 May 2014  , speaking at a conference in Shanghai, pledged to settle China's territorial disputes peacefully. \"China stays committed to seeking peaceful settlement of disputes with other countries over territorial sovereignty and maritime rights and interests\", he said. \n China is regularly hailed as a  ,  with certain commentators citing its rapid economic progress, growing military might, very large population, and increasing international influence as signs that it will play a   in the 21st century.  Others, however, warn that   and demographic imbalances could slow or even halt China's growth as the century progresses. \nSome authors also question the definition of \"superpower\", arguing that China's large economy alone would not qualify it as a superpower, and noting that it lacks the military power and cultural influence of the United States.  Others — namely,   — have argued that China's investment in renewable energy has positioned it to be a likely superpower in that area, especially due to a shift in global trade relations. \n The  , social activists, and some members of the Communist Party of China have all identified the need for social and political reform. While economic and social controls have been significantly relaxed in China since the 1970s,   is still tightly restricted. The   states that the \"fundamental rights\" of citizens include  ,  , the  ,  ,  , and  . However, in practice, these provisions do not afford significant protection against criminal prosecution by the state.  Although some criticisms of government policies and the ruling   are tolerated, censorship of political speech and information, most notably on the Internet,  are routinely used to prevent collective action.  By 2020, China plans to give all its citizens a personal \"Social Credit\" score based on how they behave.  The  , now being piloted in a number of Chinese cities, is considered a form of   which uses   technology.  In 2005,   ranked China 159th out of 167 states in its Annual World Press Freedom Index, which indicates a very low level of press freedom.  In 2014, China ranked 175th out of 180 countries. \n Rural migrants to China's cities often find themselves treated as   by the     system, which controls access to  .  Property rights are often poorly protected,  However, a number of rural taxes have been reduced or abolished since the early 2000s, and additional social services provided to rural dwellers. \n A number of foreign governments, foreign press agencies, and   also routinely criticize  , alleging widespread   violations such as detention without trial,  ,  forced confessions,  , restrictions of fundamental rights,  and  .  The government suppresses popular protests and demonstrations that it considers a potential threat to \"social stability\", as was the case with the  .\n  was first taught publicly in 1992. In 1999, when there were about 70 million practitioners,  the   began, resulting in mass arrests, extralegal detention, and alleged reports of torture and deaths in custody.  The Chinese state is regularly accused of large-scale repression and human rights abuses in   and  , including violent police crackdowns and  .  At least one million members of     minority have been detained in mass  , termed \" \", aimed at changing the political thinking of detainees, their identities, and their religious beliefs.  The camps were established under    's  .  In January 2019 the United Nations asked for direct access to the detention camps after a panel said it had received “credible reports” that 1.1 million Uygur, Kazakhs, Hui and other ethnic minorities had been detained in  .  The state has even sought to control offshore reporting of tensions in Xinjiang, intimidating foreign-based reporters by detaining their family members. \n The Chinese government has responded to foreign criticism by arguing that the right to subsistence and economic development is a prerequisite to other types of human rights, and that the notion of human rights should take into account a country's present level of  .  It emphasizes the rise in the Chinese  ,  , and average   since the 1970s, as well as improvements in workplace safety and efforts to combat natural disasters such as the perennial   floods.  Furthermore, some Chinese politicians have spoken out in support of democratization, although  .  Some major reform efforts have been conducted. For instance, in November 2013 the government announced plans to relax the one-child policy and abolish the much-criticized   program,  although human rights groups note that reforms to the latter have been largely cosmetic.  During the 2000s and early 2010s, the Chinese government was increasingly tolerant of NGOs that offer practical, efficient solutions to social problems, but such \"third sector\" activity remained heavily regulated.  After   succeeded   in 2012, human rights in China have become worse. \n The Global Slavery Index estimated that in 2016 more than 3.8 million people were living in \"conditions of modern  \", or 0.25% of the population, including victims of human trafficking, forced labor, forced marriage, child labor, and state-imposed forced labor. All except the last category are illegal. The state-imposed forced system was formally abolished in 2013 but it is not clear the extent to which its various practices have stopped.  The Chinese penal system includes labor prison factories, detention centers, and re-education camps, which fall under the heading   (\"reform through labor\"). The Laogai Research Foundation in the United States estimated that there were over a thousand slave labour prisons and camps, known collectively as the Laogai.  Prisoners are not paid at all, and need their families to send money to them. Prisoners who refuse to work are beaten, and some are beaten to death. Many of the prisoners are political or religious dissidents, and some are recognized internationally as prisoners of conscience. A Chinese leader said that they want to see two products coming out of the prisons: the man who has been reformed, and the product made by the man.  , himself a former prisoner of the Laogai, filmed undercover footage of the Laogai, and was charged with stealing state secrets. For this,   was sentenced to 15 years in prison, but only served 66 days before being deported to the United States. \n In 2019 a world-first study called for the mass retraction of more than 400 scientific papers on  , because of fears the organs were obtained unethically from Chinese prisoners. The study was published in the medical journal BMJ Open. A report published in 2016 found a large discrepancy between official transplant figures from the Chinese government and the number of transplants reported by hospitals. While the government says 10,000 transplants occur each year, hospital data shows between 60,000 and 100,000 organs are transplanted each year. The report provided evidence that this gap is being made up by executed  . \n With 2.3 million active troops, the   (PLA) is the largest standing military force in the world, commanded by the   (CMC).  China has the second-biggest military reserve force, only behind  . The PLA consists of the   (PLAGF), the   (PLAN), the   (PLAAF), and the   (PLARF). According to the Chinese government, China's military budget for 2017 totalled US$151.5 billion, constituting the  , although the   with 1.3% of GDP is below world average.  However, many authorities – including   and the U.S.   – argue that China does not report its real level of military spending, which is allegedly much higher than the official budget. \n As a recognized   state, China is considered both a major regional military power and a  .  According to a 2013 report by the  , China fields between 50 and 75 nuclear  , along with a number of  .  However, compared with the other four   Permanent Members, China has relatively limited   capabilities.  To offset this, it has developed numerous power projection assets since the early 2000s – its   entered service in 2012,  and it maintains a substantial fleet of  , including several     and   submarines.  China has furthermore established a  . \n China has made significant progress in modernising its air force in recent decades, purchasing Russian fighter jets such as the  , and also manufacturing its own modern fighters, most notably the  ,   and the  ,  ,  , and  .  China is furthermore engaged in developing an indigenous   and numerous  .    and   weaponry advances have increased the regional threat from the perspective of Japan as well as Washington.  China has also updated its ground forces, replacing its ageing  -derived   inventory with numerous variants of the modern  , and upgrading its battlefield   and   systems to enhance its   capabilities.  In addition, China has developed or acquired numerous advanced missile systems,  including  ,    and submarine-launched nuclear ICBMs.  According to the  's data, China became the world's third largest exporter of major arms in 2010–14, an increase of 143 percent from the period 2005–09.  Chinese officials stated that spending on the military will rise to U.S. $173B in 2018.  In the period of 2014-2018, China was the fifth largest exporter of major arms in the world, with an increase of 2.7% compared to the previous period. \nIn August 2018, China tested its first  . The China Academy of Aerospace Aerodynamics (CAAA) claims to have successfully conducted the test with the aircraft Starry Sky-2 that touched a speed of   6 – which is six times the speed of sound, that can carry nuclear missiles. \n As of 2018, China had   in terms of nominal GDP, totaling approximately US$13.5 trillion (90 trillion Yuan).  In terms of   (PPP GDP), China's economy has been the largest in the world since 2014, according to the World Bank.  According to the World Bank, China's GDP grew from $150 billion in 1978 to $13.6 trillion by 2018.  China's economic growth has been consistently above 6 percent since the introduction of  .  China is also the world's   and   of goods.  Between 2010 and 2019, China's contribution to global GDP growth has been 25% to 39%. \n China had the largest economy in the world for most of the past two thousand years, during which it has seen cycles of prosperity and decline.  Since economic reforms began in 1978, China has developed into a highly diversified economy and one of the most consequential players in international trade. Major sectors of competitive strength include manufacturing, retail, mining, steel, textiles, automobiles, energy generation, green energy, banking, electronics, telecommunications, real estate, e-commerce, and tourism. China has three out of the ten largest stock exchanges in the world—Shanghai, Hong Kong and Shenzhen—that together have a market capitalization of over $10 trillion, as of 2019. \n China has been the world's #1 manufacturer since 2010, after overtaking the US, which had been #1 for the previous hundred years.  China has also been #2 in high-tech manufacturing since 2012, according to US  .  China is the second largest retail market in the world, next to the United States.  China leads the world in e-commerce, accounting for 40% of the global market share in 2016  and more than 50% of the global market share in 2019.  China is the world's leader in electric vehicles, manufacturing and buying half of all the plug-in electric cars (BEV and PHEV) in the world in 2018.  China had 174 GW of installed solar capacity by the end of 2018, which amounts to more than 40% of the global solar capacity. \n China has been   in terms of nominal GDP since 2010.  In terms of   (PPP) GDP, China's economy has been the largest in the world since 2014.  As of 2018, China was second in the world in total number of billionaires and millionaires—there were 338 Chinese billionaires  and 3.5 million millionaires.  However, it ranks behind over 70 countries (out of around 180) in per capita economic output, making it a middle income country.  Additionally, its development is highly uneven. Its major cities and coastal areas are far more prosperous compared to rural and interior regions.  China brought more people out of extreme poverty than any other country in history —between 1978 and 2018, China reduced extreme poverty by 800 million. China reduced the extreme poverty rate—per international standard, it refers to an income of less than $1.90/day—from 88% in 1981 to 1.85% by 2013.  According to the World Bank, the number of Chinese in extreme poverty fell from 756 million to 25 million between 1990 and 2013.  China's own national poverty standards are higher and thus the national poverty rates were 3.1% in 2017  and 1% in 2018. \n In 2019, China overtook the US as the home to the highest number of rich people in the world, according to the global wealth report by  .  In other words, as of 2019, 100 million Chinese are in the Top 10% of the wealthiest individuals in the world —those who have a net personal wealth of at least $110,000.\n From its founding in 1949 until late 1978, the People's Republic of China was a Soviet-style centrally  . Following Mao's death in 1976 and the consequent end of the  ,   and the new Chinese leadership began to   and move towards a more market-oriented   under one-party rule.   was dismantled and farmlands privatized, while foreign trade became a major new focus, leading to the creation of   (SEZs). Inefficient   (SOEs) were restructured and unprofitable ones were closed outright, resulting in massive job losses. Modern-day China is mainly characterized as having a market economy based on private property ownership,  and is one of the leading examples of  .  The state still dominates in strategic \"pillar\" sectors such as energy production and  , but private enterprise has expanded enormously, with around 30 million private businesses recorded in 2008.  In 2018, private enterprises in China accounted for 60% of GDP, 80% of urban employment and 90% of new jobs. \n In 2015, China's Middle Class became the largest in the world.  By 2019, there were more Chinese than Americans in the richest 10% of the people in the world.  Since economic liberalization began in 1978, China has been among the world's fastest-growing economies,  relying originally on investment- and export-led growth, but now shifting more to consumption.  In 2018, 76% of growth in China's GDP came from consumption.  According to the IMF, China's   between 2001 and 2010 was 10.5%. In the years immediately following the financial crisis of 2007, China's economic growth rate was equivalent to all of the   countries' growth combined.  According to the   index announced by   in February 2011, China has a very high 3G growth rating.  Its high productivity, low labor costs and relatively good infrastructure have made it a global leader in manufacturing.\n China ranks #1 in the production of steel, aluminum and automobiles—China's global market shares are 50% in steel,  50% in aluminum  and 30% in automobile manufacturing.  China has also been increasingly turning to automation, becoming the world's largest market for industrial robots in 2013. Between 2010 and 2015, China installed 90,000 industrial robots, or one-third of the world's total.  In 2017, China bought 36% of all the new industrial robots in the world.  China's plan is to also domestically design and manufacture 100,000 industrial robots by 2020.  However, the Chinese economy is highly energy-intensive and inefficient;  China became the world's largest   in 2010,  relies on coal to supply over 70% of its energy needs, and surpassed the US to become the world's largest oil importer in 2013. \n In the last decade, China has become   in terms of installed solar power capacity, hydro-power and wind power. According to the  , China will account for 40% of the global renewable energy by 2022.  In addition, official GDP figures are seen as unreliable and there have been several well-publicized cases of data manipulation.  In the early 2010s, China's economic growth rate began to slow amid domestic credit troubles, weakening international demand for Chinese exports and fragility in the global economy.  China's GDP was smaller than Germany's in 2007; however, by 2017, China's $12.2 trillion-economy became larger than those of Germany, UK, France and Italy combined.  In 2018, the IMF reiterated its forecast that China will overtake the US in terms of nominal GDP by the year 2030.  Economists also expect China's middle class to expand to 600 million people by 2025. \n Tourism is a major contributor to the economy. In 2017, this sector contributed about CNY 8.77 trillion (US$1.35 trillion), 11.04% of the GDP, and contributed direct and indirect employment of up to 28.25 million people. There were 139.48 million inbound trips and five billion domestic trips.  China is now #1 in the number of skyscrapers (buildings taller than 200m), accounting for about 50% of world's total.  In four years—2015 through 2018—China built 310 skyscrapers, while the corresponding number for the US was 33. \n China is one of the world's most technologically advanced nations.  It is the world's largest e-commerce market, amounting to 42% of the global market by 2016   and is expected to account for 55% of global e-commerce retail sales in 2019 (more than three times as large as the US market).  China's e-commerce market had online sales of more than $1 trillion in 2018, according to   and is expected to be just under $2 trillion in 2019.  China's   industry took off in 2009, marked by the growth of internet giants   and   – purveyors of products such as   and   – that have become ubiquitous in contemporary Chinese life. Tencent's   and Alibaba's   have helped China become a world leader in mobile payments, which amounted to about $30 trillion in China in 2017 and more than $40 trillion in 2018. \n China is also second only to the United States in   activity and is home to a large number of   startup companies.  In 2018, China attracted $105 billion of venture capital investments, amounting to 38% of global VC investments that year.  In late 2018, the world's most valuable startup was  , a Chinese company;  and the two most valuable   (AI) startups in the world were   and Face++, both from China.  In 2017, China's State Council released its Artificial Intelligence Development Plan, which declared AI technology a priority economic growth and investment sector.  In 2018, China created 97 \"unicorns\" – startups that are worth more than $1 billion – which amounted to 1 unicorn every 3.8 days.  Chinese smartphone brands –  ,  ,  ,  ,   etc. – have captured more than 40% of the global market.  By 2019, Huawei had become the world's largest telecom infrastructure provider, surpassing   and  , and had taken the lead in   technology.  The company also entered the consumer   and   services markets,  and is the world's third-largest smartphone company, after   and  . \n Other Chinese tech giants include DJI (world's largest drone maker with 70% market share),  BOE (world's largest flat-panel display maker),   Didi (world's largest and most valuable ride-sharing company)  and BYD (world's largest plug-in vehicle maker—including both BEV and PHEV)  China also the most number of supercomputers—227 out of the Top 500 (as of 2019). \n China is also the world leader in patents, accounting for 1.54 million patents or almost half of all global patents in 2018.  China's spending on R&D has been growing rapidly in the last decade, amounting to $277 billion in 2017. \n China is a member of the   and is the world's largest trading power, with a total international trade value of US$4.62 trillion in 2018.    reached US$3.1 trillion as of 2019,  making its reserves by far the world's largest.  In 2012, China was the world's largest recipient of inward   (FDI), attracting $253 billion.  In 2014, China's foreign exchange remittances were $US64 billion making it the second largest recipient of remittances in the world.  China also invests abroad, with a total outward FDI of $62.4 billion in 2012,  and a number of major takeovers of foreign firms by Chinese companies.  China is a major owner of  , holding trillions of dollars worth of U.S.  .  China's undervalued exchange rate has caused friction with other major economies,  and it has also been widely criticized for manufacturing large quantities of   goods. \n China ranks 17th in the world in Global Innovation Index, not too far from the US, which ranks 6th.  China ranks 27th out of 137 countries in the 2017-2018  ,  above many advanced economies and making it by far the most competitive major emerging economy. This is largely owing to its strength in infrastructure and wide adoption of communication and information technology. However, it lags behind advanced economies in labor market efficiency, institutional strength, and openness of market competition, especially for foreign players attempting to enter the domestic market.  In 2018,  s   list of the world's largest corporations included  .  Many of the largest   in the world were Chinese, including the  , the  . \n Following the 2007-08 financial crisis, Chinese authorities sought to actively wean off of its dependence on the U.S. Dollar as a result of perceived weaknesses of the international monetary system.  To achieve those ends, China took a series of actions to further the  . In 2008, China established   market and expanded the Cross-Border Trade RMB Settlement Pilot Project, which helps establish pools of offshore RMB liquidity.  This was followed with bilateral agreements to settle trades directly in renminbi with Russia,   ,   ,   ,  the  ,  and  .  As a result of the rapid internationalization of the renminbi, it became the eighth-most-traded currency in the world, an emerging international  ,  and a component of the IMF's  ; however, partly due to capital controls that make the renminbi fall short of being a fully convertible currency, it remains far behind the Euro, Dollar and Japanese Yen in international trade volumes. \n China has had the world's largest middle class population since 2015,  and the middle class grew to a size of 400 million by 2018.  China's middle-class population (if defined as those with annual income of between US$10,000 and US$60,000) had reached more than 300 million by 2012.  Wages in China have grown exponentially in the last 40 years—real (inflation-adjusted) wages grew seven-fold from 1978 to 2007.  By 2018, median wages in Chinese cities such as Shanghai were about the same as or higher than the wages in Eastern European countries.  More than 75 percent of China's urban consumers are expected to earn between 60.000 and 229.000 RMB per year by 2022.  China has the world's second-highest number of billionaires, with nearly 400 as of 2018, increasing at the rate of roughly two per week.  China's domestic retail market was worth over 20 trillion yuan (US$3.2 trillion) in 2012  and is growing at over 12% annually as of 2013 ,  while the country's luxury goods market has expanded immensely, with 27.5% of the global share.  However, in recent years, China's rapid economic growth has contributed to severe consumer inflation,  leading to increased government regulation.  China has a high level of economic inequality,  which has increased in the past few decades.  In 2012, China's official   was 0.474.  A study conducted by   showed that China's Gini coefficient actually had reached 0.61 in 2012, and top 1% Chinese held more than 25% of China's wealth.  By 2015, China's GINI index had fallen to 0.38, according to World Bank. \n China was once a world leader in science and technology up until the  .  Ancient   and  , such as  ,  , the  , and   (the  ), became widespread across East Asia, the Middle East and later to Europe. Chinese mathematicians were the first to use  .  By the 17th century, Europe and the Western world surpassed China in scientific and technological advancement.  The causes of this early modern   continue to be debated by scholars to this day. \n After repeated   by the European colonial powers and   in the 19th century, Chinese reformers began promoting modern science and technology as part of the  . After the Communists came to power in 1949, efforts were made to organize science and technology based on the model of the  , in which scientific research was part of central planning.  After Mao's death in 1976, science and technology was established as one of the  ,  and the Soviet-inspired academic system was gradually reformed. \n Since the end of the Cultural Revolution, China has made significant investments in scientific research  and is quickly catching up with the US in R&D spending.  In 2017, China spent $279 billion on scientific research and development.  According to  , China spent 2.11% of its GDP on Research and Development (R&D) in 2016.  Science and technology are seen as vital for achieving China's economic and political goals, and are held as a source of national pride to a degree sometimes described as \"techno-nationalism\".  Nonetheless, China's investment in basic and applied scientific research remains behind that of leading technological powers such as the United States and Japan.  According to the US  , China had, for the first time, more science and engineering publications than the US, in 2016.  Also, in 2016, China spent $409 billion (by PPP) on Research and Development.  In 2018, China is estimated to have spent $475 billion (by PPP), second only to the USA.  In 2017, China was #2 in international patents application, behind the US but ahead of Japan.  Chinese tech companies Huawei and ZTE were the top 2 filers of international patents in 2017.  Chinese-born scientists have won the   four times, the   and   once respectively, though most of these scientists conducted their Nobel-winning research in western nations. \n China is developing its education system with an emphasis on  ; in 2009, China graduated over 10,000 Ph.D. engineers, and as many as 500,000   graduates, more than any other country.  In 2016, there were 4.7 million STEM (Science, Technology, Engineering and Mathematics) graduates in China, which was more than eight times the corresponding number for the US.  China also became the world's largest publisher of   by 2016.  Chinese technology companies such as   and   have become world leaders in telecommunications and personal computing,  and Chinese   are consistently ranked among the  .  China is also expanding its use of industrial  ; from 2008 to 2011, the installation of multi-role robots in Chinese factories rose by 136 percent.  China has been the world's largest market for industrial robots since 2013 and will account for 45% of newly installed robots from 2019-2021. \n The   is one of the world's most active, and is a major source of national pride.  In 2018, China successfully launched more satellites (35) than any other country, including the USA (30).  In 1970, China launched its first satellite,  , becoming the fifth country to do so independently.  In 2003, China became the third country to independently send humans into space, with  's spaceflight aboard  ; as of 2015 ,   have journeyed into space, including two women. In 2011, China's first space station module,  , was launched, marking the first step in a project to assemble   by the early 2020s.  In 2013, China successfully landed the   lander and   rover onto the lunar surface.  In 2016, China's 2nd space station module,  , was launched from   aboard a   rocket on 15 September 2016. Then   successfully docked with Tiangong-2 on 19 October 2016. In 2019, China became the first country to land a probe— —on the far side of the moon.\n A 2016 report by   consulting group, revealed that China has been annually spending more on infrastructure than North America and Western Europe combined. \n China is the largest telecom market in the world and currently has the   of any country in the world, with over 1.5 billion subscribers, as of 2018.  It also has the world's largest number of   and  , with over 800 million Internet users as of 2018 —equivalent to around 60% of its population—and almost all of them being mobile as well.  Almost entire China's population had access to 4G network by 2017.  By 2018, China had more than 1 billion 4G users, accounting for 40% of world's total.  In terms of unique mobile subscribers as percentage of population, China came in at 82%, placing the country #3 in the world (as of 2018).  As of early 2019, the average mobile connection speed in China was 30 Mbit/s (megabits per second),  which is 9% slower than the US.  As for fixed broadband in China, the average download speed was 76 Mbit/s;  and 60% of fixed broadband Chinese users (or 200 million Chinese households) were able to access the Internet at 100 Mbit/s or higher (as of 2018).  China is making rapid progress in 1 Gbit/s (1000 Mbit/s) internet, and 42% of Chinese homes are expected to have 1 Gbit/s broadband link by 2023.  In 2018, China had 378 million fixed broadband users and 87% of them were fiber-optic users, making China #1 in the world in deployment of fiber-optic cables for broadband.  By the end of 2017, China had 29 million kilometers of fiber-optic cable.  In 2019, China is expected to account for 24% of the world's spending on IoT or internet-connected devices.  Since 2011 China has been the nation with the most installed telecommunication bandwidth in the world. By 2014, China hosted more than twice as much national bandwidth potential than the U.S., the historical leader in terms of installed telecommunication bandwidth (China: 29% versus US:13% of the global total).  China is making rapid advances in 5G—by late 2018, China had started large-scale and commercial 5G trials.  In early 2019, Shanghai railway station introduced 5G WiFi that has an internet speed of 1,200 Mbit/s. \n ,   and  , are the three large providers of mobile and internet in China. China Telecom alone served more than 145 million broadband subscribers and 300 million mobile users; China Unicom had about 300 million subscribers; and China Mobile, the biggest of them all, had 925 million users, as of 2018.  Combined, the three operators had over 3.4 million 4G base-stations in China.  Several Chinese telecommunications companies, most notably   and  , have been accused of spying for the Chinese military.  British intelligence—GCHQ and NCSC—said in 2019 that there have been no evidence of malicious activity or spying by Huawei. \n China is developing its own   system, dubbed  , which began offering commercial navigation services across Asia in 2012  and it started providing global services by the end of 2018.  Now China belongs to the elite group of three countries—US and Russia being the other two members—that provide global satellite navigation.\n Since the late 1990s, China's national road network has been significantly expanded through the creation of a network of   and  . In 2018,   had reached a total length of 142,500 km (88,500 mi), making it the  ;  and China's railways reached a total length of 127,000 km by 2017.  By the end of 2018, China's   network reached a length of 29,000 km, representing more than 60% of the world's total.  In 1991, there were only six bridges across the main stretch of the Yangtze River, which bisects the country into northern and southern halves. By October 2014, there were  .\nChina has the world's largest market for automobiles, having surpassed the United States in both auto sales and  . Sales of passenger cars in 2016 exceeded 24 million.  A side-effect of the rapid growth of China's road network has been a significant rise in traffic accidents,  with   cited as a possible cause—in 2011 alone, around 62,000 Chinese died in road accidents.  However, the Chinese government has taken a lot of steps to address this problem and has reduced the number of fatalities in traffic accidents by 20% from 2007 to 2017.  In urban areas, bicycles remain a common mode of transport, despite the increasing prevalence of automobiles – as of 2012 , there are approximately 470 million bicycles in China. \n , which are  , are among  , handling a quarter of the world's rail traffic volume on only 6 percent of the world's tracks in 2006.  as of 2017 , the country had 127,000 km (78,914 mi) of railways, the  .  The railways strain to meet enormous demand particularly during the   holiday, when the   takes place.  In 2013, Chinese railways delivered 2.106 billion passenger trips, generating 1,059.56 billion passenger-kilometers and carried 3.967 billion tons of freight, generating 2,917.4 billion cargo tons-kilometers. \n China's   started construction in the early 2000s. By the end of 2018,   had over 29,000 kilometers (18,020 miles) of dedicated lines alone, a length that exceeds rest of the world's high-speed rail tracks combined, making it the  .  With an annual ridership of over 1.1 billion passengers in 2015 it is the world's busiest.  The network includes the  , the single longest HSR line in the world, and the  , which has  .  The HSR track network is set to reach approximately 30,000 km (19,000 mi) by the end of 2019.  The  , which reaches 431 km/h (268 mph), is the fastest commercial train service in the world.  In May 2019, China released a prototype for a   high-speed train that would reach a speed of 600 km/hr (375 mph); and it is expected to go into commercial production by 2021.  \n Since 2000, the growth of rapid transit systems in Chinese cities has accelerated. As of January 2016 , 26 Chinese cities have   in operation and 39 more have metro systems approved  with a dozen more to join them by 2020.  The  ,  ,  ,   and   are among the   and   in the world.\n There were   with around 240 planned by 2020. More than two-thirds of the airports under construction worldwide in 2013 were in China,  and   expects that China's fleet of active commercial aircraft in China will grow from 1,910 in 2011 to 5,980 in 2031.  In just five years—from 2013 to 2018—China bought 1000 planes from Boeing.  With rapid expansion in  , the   have also joined the ranks of the  . In 2018, Beijing's   ranked second in the world by   (it was 26th in 2002). Since 2010, the   and   have ranked first and third in  .\n Some 80% of China's airspace remains restricted for  , and   made up eight of the 10 worst-performing Asian airlines in terms of delays. \nChina has over 2,000  , about 130 of which are open to foreign shipping. In 2017, the Ports of  ,  ,  ,  ,  ,   and   ranked in the Top 10 in the world   and  . \n Water supply and sanitation infrastructure in China is facing challenges such as rapid urbanization, as well as  .  According to data presented by the   of   and   in 2015, about 36% of the rural population in China still did not have access to  .  In June 2010, there were 1,519   in China and 18 plants were added each week.  The ongoing   intends to abate water shortage in the north. \n The   recorded the population of the People's Republic of China as approximately 1,370,536,875. About 16.60% of the population were 14 years old or younger, 70.14% were between 15 and 59 years old, and 13.26% were over 60 years old.  The population growth rate for 2013 is estimated to be 0.46%.  China used to make up much of the world's poor; now it makes up much of the world's middle class.  Although a middle-income country by Western standards, China's rapid growth has  —800 million, to be more precise —of its people out of poverty since 1978. By 2013, less than 2% of the Chinese population lived below the international poverty line of US$1.9 per day, down from 88% in 1981.  China's own standards for poverty are higher and still the country is on its way to eradicate national poverty completely by 2019.  From 2009–2018, the unemployment rate in China has averaged about 4%. \n Given concerns about population growth, China implemented a two-child limit during the 1970s, and, in 1979, began to advocate for an even stricter limit of one child per family. Beginning in the mid 1980s, however, given the unpopularity of the strict limits, China began to allow some major exemptions, particularly in rural areas, resulting in what was actually a \"1.5\"-child policy from the mid-1980s to 2015 (ethnic minorities were also exempt from one child limits). The next major loosening of the policy was enacted in December 2013, allowing families to have two children if one parent is an only child.  In 2016, the one-child policy was replaced in favor of a  .  Data from the 2010 census implies that the   may be around 1.4, although due to underreporting of births it may be closer to 1.5–1.6. \n According to one group of scholars, one-child limits had little effect on population growth  or the size of the total population.  However, these scholars have been challenged. Their own counterfactual model of fertility decline without such restrictions implies that China averted more than 500 million births between 1970 and 2015, a number which may reach one billion by 2060 given all the lost descendants of births averted during the era of fertility restrictions, with one-child restrictions accounting for the great bulk of that reduction. \n The policy, along with traditional preference for boys, may have contributed to an imbalance in the   at birth.  According to the 2010 census, the sex ratio at birth was 118.06 boys for every 100 girls,  which is beyond the normal range of around 105 boys for every 100 girls.  The 2010 census found that males accounted for 51.27 percent of the total population.  However, China's sex ratio is more balanced than it was in 1953, when males accounted for 51.82 percent of the total population. \n China legally recognizes 56 distinct ethnic groups, who altogether comprise the  . The largest of these nationalities are the ethnic Chinese or \"Han\", who constitute more than 80% of the total\npopulation.  The Han Chinese – the world's largest single ethnic group  – outnumber other ethnic groups in every provincial-level division except   and  .  Ethnic minorities account for about less than 25% of the population of China, according to\nthe 2010 census.  Compared with the 2000 population census, the Han population increased by 66,537,177 persons, or 5.74%, while the population of the 55 national minorities combined increased by 7,362,627 persons, or 6.92%.  The 2010 census recorded a total of 593,832 foreign nationals living in China. The largest such groups were from South Korea (120,750), the\nUnited States (71,493) and Japan (66,159). \n There are as many as 292   in China.  The languages most commonly spoken belong to the   of the   family, which contains   (spoken by 70% of the population),  and   of  :   (including   and  ),   (including   and  ),   (including  ,   and  ),  ,   and  . Languages of the  , including  ,  ,   and  , are spoken across the   and  . Other ethnic minority languages in   include  ,  ,   and   of the  ,   and   of the  , and   of the  . Across   and  , local ethnic groups speak   including  ,   and several  :  ,  ,  ,   and  .   is spoken natively along the border with  .  , the language of  , is an  .  , including a small population on the mainland, speak  . \n , a variety of Mandarin based on the  , is the official national language of China and is used as a   in the country between people of different linguistic backgrounds. \n  have been used as the   for the Sinitic languages for thousands of years. They allow speakers of mutually unintelligible Chinese varieties to communicate with each other through writing. In 1956, the government introduced  , which have supplanted the older   in mainland China. Chinese characters are   using the  . Tibetan uses an   based on an  . Uyghur is most commonly written in   based  . The   and the   are both derived from the  .   uses both an official   and a traditional  .\n China has urbanized significantly in recent decades. The percent of the country's population living in urban areas increased from 20% in 1980 to over 55% in 2016.  It is estimated that China's urban population will reach one billion by 2030, potentially equivalent to one-eighth of the world population.  As of 2012 , there are more than 262 million   in China, mostly rural migrants seeking work in cities. \n China has over 160 cities with a population of over one million,  including the seven   (cities with a population of over 10 million) of Chongqing, Shanghai, Beijing, Guangzhou, Tianjin, Shenzhen, and Wuhan.  By 2025, it is estimated that the country will be home to 221 cities with over a million inhabitants.  The figures in the table below are from the 2010 census,  and are only estimates of the urban populations within administrative city limits; a different ranking exists when considering the total municipal populations (which includes suburban and rural populations). The large \" \" of migrant workers make conducting censuses in urban areas difficult;  the figures below include only long-term residents.\n Since 1986, compulsory education in China comprises   and  , which together last for nine years.  In 2010, about 82.5 percent of students continued their education at a three-year senior secondary school.  The  , China's national university entrance exam, is a prerequisite for entrance into most higher education institutions. In 2010, 27 percent of secondary school graduates are enrolled in higher education.  This number increased significantly over the last years, reaching a tertiary school enrollment of 48.4 percent in 2016.  Vocational education is available to students at the secondary and   level. \n In February 2006, the government pledged to provide completely free nine-year education, including textbooks and fees.  Annual education investment went from less than US$50 billion in 2003 to more than US$250 billion in 2011.  However, there remains an inequality in education spending. In 2010, the annual education expenditure per secondary school student in Beijing totalled ¥20,023, while in  , one of the  , only totalled ¥3,204.  Free compulsory education in China consists of primary school and junior secondary school between the ages of 6 and 15. In 2011, around 81.4% of Chinese have received secondary education.  By 2007, there were 396,567 primary schools, 94,116 secondary schools, and 2,236 higher education institutions in China. \n As of 2010 , 94% of the population over age 15 are literate.  In 1949, only 20% of the population could read, compared to 65.5% thirty years later.  In 2009, Chinese students from Shanghai achieved the world's best results in mathematics, science and literacy, as tested by the   (PISA), a worldwide evaluation of 15-year-old school pupils' scholastic performance.  Despite the high results, Chinese education has also faced   for its emphasis on rote memorization and its gap in quality from rural to urban areas. \n The  , together with its counterparts in the local commissions, oversees the health needs of the Chinese population.  An emphasis on public health and preventive medicine has characterized Chinese health policy since the early 1950s. At that time, the Communist Party started the  , which was aimed at improving sanitation and hygiene, as well as treating and preventing several diseases. Diseases such as  ,   and  , which were previously rife in China, were nearly eradicated by the campaign. After Deng Xiaoping began instituting economic reforms in 1978, the health of the Chinese public improved rapidly because of better nutrition, although many of the free public health services provided in the countryside disappeared along with the People's Communes. Healthcare in China became mostly  , and experienced a significant rise in quality. In 2009, the government began a 3-year large-scale healthcare provision initiative worth US$124 billion.  By 2011, the campaign resulted in 95% of China's population having basic health insurance coverage.  In 2011, China was estimated to be the world's third-largest supplier of  , but its population has suffered from the development and distribution of  . \n As of 2012 , the average life expectancy at birth in China is 75 years,  and the   rate is 12 per thousand.  Both have improved significantly since the 1950s.  Rates of  , a condition caused by  , have declined from 33.1% in 1990 to 9.9% in 2010.  Despite significant improvements in health and the construction of advanced medical facilities, China has several emerging public health problems, such as respiratory illnesses caused by  ,  hundreds of millions of  ,  and an increase in   among urban youths.  China's large population and densely populated cities have led to serious disease outbreaks in recent years, such as the 2003 outbreak of  , although this has since been largely contained.  In 2010, air pollution caused 1.2 million premature deaths in China. \n Religion in China (  2014) \n The government of the People's Republic of China officially espouses  ,  and has conducted   to this end.  Religious affairs and issues in the country are overseen by the  .    is guaranteed by China's constitution, although religious organizations that lack official approval can be subject to state persecution. \n Over the millennia, Chinese civilization has been influenced by various religious movements. The \" \", including  ,  , and   ( ), historically have a significant role in shaping Chinese culture,  enriching a   which harkens back to the early   and  . Chinese popular or folk religion, which is framed by the three teachings and other traditions,  consists in allegiance to the   ( ), a character that signifies the \" \", who can be   of the environment or   of human groups, concepts of civility,  , many of whom feature in   and history.  Among the most popular   are those of   (goddess of the seas),    (one of the two   of the Chinese race),    (god of war and business),   (god of prosperity and richness),   and many others. China is home to many of the  , including the tallest of all, the   in  .\n Clear data on religious affiliation in China is difficult to gather due to varying definitions of \"religion\" and the unorganized, diffusive nature of Chinese religious traditions. Scholars note that in China there is no clear boundary between   religions and local folk religious practice.  A 2015 poll conducted by   found that 61% of Chinese people self-identified as \"convinced atheist\",  though it is worthwhile to note that Chinese religions or some of their strands are definable as   and   religions, since they do not believe that divine creativity is completely transcendent, but it is inherent in the world and in particular in the human being.  According to a 2014 study, approximately 74% are either non-religious or practise Chinese folk belief, 16% are Buddhists, 2% are Christians, 1% are Muslims, and 8% adhere to other religions including   and  .  In addition to Han people's local religious practices, there are also various   who maintain their  . The various folk religions today comprise 2–3% of the population, while Confucianism as a religious self-identification is common within the intellectual class. Significant faiths specifically connected to certain ethnic groups include   and the   of the  ,  ,  ,   and other peoples in Northwest China.\n Since ancient times, Chinese culture has been heavily influenced by  . For much of the country's dynastic era, opportunities for social advancement could be provided by high performance in the prestigious  , which have their origins in the  .  The   of the exams affected the general perception of cultural refinement in China, such as the belief that  ,   and   were higher forms of art than dancing or drama. Chinese culture has long emphasized a sense of deep history and a largely inward-looking national perspective.  Examinations and a   remain greatly valued in China today. \n The first leaders of the People's Republic of China were born into the traditional imperial order, but were influenced by the   and reformist ideals. They sought to change some traditional aspects of Chinese culture, such as rural land tenure,  , and the Confucian system of education, while preserving others, such as the family structure and culture of obedience to the state. Some observers see the period following the establishment of the PRC in 1949 as a continuation of traditional Chinese dynastic history, while others claim that the Communist Party's rule has damaged the foundations of Chinese culture, especially through political movements such as the   of the 1960s, where many aspects of traditional culture were destroyed, having been denounced as \"regressive and harmful\" or \"vestiges of  \". Many important aspects of traditional Chinese morals and culture, such as Confucianism, art, literature, and performing arts like  ,  were altered to conform to government policies and propaganda at the time. Access to foreign media remains heavily restricted. \n Today, the Chinese government has accepted numerous elements of traditional Chinese culture as being integral to Chinese society. With the rise of   and the end of the Cultural Revolution, various forms of traditional Chinese art, literature, music, film, fashion and architecture have seen a vigorous revival,  and folk and variety art in particular have sparked interest nationally and even worldwide.  China is now the  ,  with 55.7 million inbound international visitors in 2010.  It also experiences an enormous volume of  ; an estimated 740 million Chinese holidaymakers travelled within the country in October 2012. \n Chinese literature is based on the literature of the  .  Concepts covered within the   present a wide range of   and subjects including  ,  ,  ,  ,   and many others.  Some of the most important early texts include the   and the   within the   which served as the Confucian authoritative books for the state-sponsored curriculum in dynastic era.  Inherited from the  ,   developed to its floruit during the Tang dynasty.   and   opened the forking ways for the poetic circles through romanticism and realism respectively.    began with the  , the overall scope of the historiographical tradition in China is termed the  , which set a vast stage for Chinese fictions along with   and  .  Pushed by a burgeoning citizen class in the  , Chinese classical fiction rose to a boom of the historical, town and   as represented by the   which include  ,  ,   and  .  Along with the   fictions of   and  ,  it remains an enduring source of popular culture in the  . \n In the wake of the   after the end of the Qing dynasty, Chinese literature embarked on a new era with   for ordinary citizens.   and   were pioneers in modern literature.  Various literary genres, such as  ,  ,   and the  , which is influenced by  ,  emerged following the Cultural Revolution.  , a xungen literature author, was awarded the Nobel Prize in Literature in 2012. \n Chinese cuisine is highly diverse, drawing on several millennia of culinary history and geographical variety, in which the most influential are known as the \"Eight Major Cuisines\", including  ,  ,  ,  ,  ,  ,  , and   cuisines.  All of them are featured by the precise skills of shaping, heating, colorway and flavoring.  Chinese cuisine is also known for its width of   and ingredients,  as well as   that is emphasized by  .  Generally, China's staple food is rice in the south, wheat based breads and noodles in the north. The diet of the common people in pre-modern times was largely grain and simple vegetables, with meat reserved for special occasions. And the bean products, such as   and  , remain as a popular source of protein.  Pork is now the most popular meat in China, accounting for about three-fourths of the country's total meat consumption.  While pork dominates the meat market, there is also the vegetarian   and the pork-free  . Southern cuisine, due to the area's proximity to the ocean and milder climate, has a wide variety of seafood and vegetables; it differs in many respects from the wheat-based diets across dry northern China. Numerous offshoots of Chinese food, such as   and  , have emerged in the nations that play host to the  .\n China has become a prime sports destination worldwide. The country gained the hosting rights for several major global sports tournaments including the  , the  , the   and the upcoming  .\n China has one of the   in the world. There is evidence that   ( ) was practiced during the  . Swordplay ( ) and  , a sport loosely related to   date back to China's early dynasties as well. \n  is widely emphasized in Chinese culture, with morning exercises such as   and   widely practiced,  and commercial   and private fitness clubs are gaining popularity across the country.  Basketball is currently the most popular spectator sport in China.  The   and the American   have a huge following among the people, with native or ethnic Chinese players such as   and   held in high esteem.  China's professional football league, now known as  , was established in 1994, it is the largest football market in Asia.  Other popular sports in the country include  ,  ,  ,   and  .   such as   (known as   in Chinese),  ,  , and more recently  , are also played at a professional level.  In addition, China is home to a huge number of  , with an estimated 470 million bicycles as of 2012 .  Many more traditional sports, such as   racing,   and   are also popular. \n China has   since 1932, although it has only participated as the PRC  . China hosted the   in Beijing, where its athletes received 51 gold medals –   of any participating nation that year.  China also won the most medals of any nation at the  , with 231 overall, including 95 gold medals.  In 2011,   in Guangdong, China hosted the  . China hosted the   in Tianjin and the   in  . Beijing and its nearby city   of   will also collaboratively host the  , which will make Beijing the first city in the world to hold both the Summer Olympics and the Winter Olympics."}
]